NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
/*
 * This confidential and proprietary software may be used only as
 * authorized by a licensing agreement from ARM Limited
 * (C) COPYRIGHT 2006-2012 ARM Limited
 * ALL RIGHTS RESERVED
 * The entire notice above must be reproduced on all authorised
 * copies and copies may only be made to the extent permitted
 * by a licensing agreement from ARM Limited.
 */
#include <mali_system.h>

#include <shared/m200_gp_frame_builder.h>
#include <shared/m200_gp_frame_builder_struct.h>
#include <shared/m200_gp_frame_builder_inlines.h>
#include <shared/m200_gp_frame_builder_dependency.h>

#include <util/mali_math.h>
#include <base/mali_debug.h>
#include <base/mali_macros.h>
#include <base/mali_byteorder.h>
#include <base/mali_memory.h>
#include <base/mali_profiling.h>
#include <regs/MALIGP2/mali_gp_core.h>
#include <regs/MALI200/mali_rsw.h>

#include "m200_regs.h"
#include "m200_frame.h"

#include <shared/mali_surface.h>
#include "shared/m200_incremental_rendering.h"
#include "m200_readback_util.h"

#include "mali_counters.h"
#include "mali_log.h"
#include "mali_instrumented_context.h"
#include "mali_pp_instrumented.h"
#include "mali_gp_instrumented.h"

#if MALI_INSTRUMENTED
#include <base/instrumented/mali_gp_instrumented_internal.h>
#include <base/common/instrumented/base_common_pp_instrumented.h>
#endif  /* MALI_INSTRUMENTED */

#if MALI_TIMELINE_PROFILING_ENABLED
#include <base/mali_profiling.h>
#endif

#if MALI_FRAMEBUFFER_DUMP_ENABLED
#include <shared/m200_fbdump.h>
#endif

/* the number of flushes between resets before incremental rendering is requested */
#ifdef HARDWARE_ISSUE_3526
/* make incremental rendering trigger less often to reduce the chance of
 * rendering-errors due to this issue. Removing it completely is not
 * possible.
 */
#define INCREMENTAL_RENDERING_THRESHOLD 2000
#else
#define INCREMENTAL_RENDERING_THRESHOLD 50
#endif

#if !defined(HARDWARE_ISSUE_3251)
/* default heap size must be 1024 aligned as this is the maximum tile list block bytesize */
#ifndef __SYMBIAN32__
#define HEAP_DEFAULT_SIZE (1024 * 32)
#define HEAP_GROW_SIZE    (1024 * 256)
#else
/* Symbian devices prefer to conserve memory, and also make less use of these heaps in practice */
#define HEAP_DEFAULT_SIZE (1024 * 64)
#define HEAP_GROW_SIZE    (1024 * 128)
#endif
#define HEAP_MAX_SIZE     (1024 * 1024 *16 * 4)
#define HEAP_THRESHOLD_SIZE     (1024 * 32)
#else
/* use one large static heap block */
#define HEAP_STATIC_SIZE (1024 * 1024 * 8)
#endif

/* make up FB identifier from type speficier and unique id */
#define MAKE_FRAME_BUILDER_ID(type,uniq_id)		((((type) & 0xFF) << 24) | ((uniq_id) & 0xFFFFFF))

/* make up flush identifier from internal frame number , flush type (reset_on_finish) and unique id */
#define MAKE_FLUSH_ID(frame,reset,uniq_id)		((((frame) & 0xFF) << 24) | ((reset&1)<<23) | ((uniq_id) & 0x7FFFFF))

#if MALI_PERFORMANCE_KIT
static int mali_complete_jobs_instantly = -1;
static int mali_simple_hw_perf = -1;
static int mali_custom_hw_perf = -1;
static int mali_print_custom_hw_perf = -1;
#endif

MALI_STATIC mali_err_code _mali_frame_builder_plbu_init( mali_internal_frame *frame );
MALI_STATIC void _mali_frame_builder_update_heap_address( mali_internal_frame *frame );

/* forward declaration */
MALI_STATIC mali_ds_release _flush_fragment_callback(mali_base_ctx_handle base_ctx, mali_internal_frame *frame, mali_ds_error status);

MALI_STATIC void _start_pp_processing_callback(mali_internal_frame *frame);

MALI_STATIC_FORCE_INLINE u32 suggest_pp_split_count(u32 width, u32 height)
{
	/* round up to nearest 16 pixels, then divide by it */
	u32 m_tile_width  = (width + (MALI200_TILE_SIZE-1)) / MALI200_TILE_SIZE;
	u32 m_tile_height = (height + (MALI200_TILE_SIZE-1)) /MALI200_TILE_SIZE;
	u32 num_tiles = m_tile_width * m_tile_height;

	return MIN( _mali_pp_get_num_cores(), num_tiles );
}

MALI_EXPORT void _mali_frame_set_inc_render_on_flush( mali_frame_builder* frame_builder, mali_bool value )
{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	frame_builder->inc_render_on_flush = value;
}

#ifdef DEBUG

/* Debug function to print gp_job & pp_job errorcodes in an understandable format */
MALI_STATIC void _debug_print_mali_jobstat( u32 job_stat )
{
	const char *job_verbose[] =
	{
		"MALI_JOB_STATUS_END_SUCCESS",
		"MALI_JOB_STATUS_END_OOM",
		"MALI_JOB_STATUS_END_ABORT",
		"MALI_JOB_STATUS_END_TIMEOUT_SW",
		"MALI_JOB_STATUS_END_HANG",
		"MALI_JOB_STATUS_END_SEG_FAULT",
		"MALI_JOB_STATUS_END_ILLEGAL_JOB",
		"MALI_JOB_STATUS_END_UNKNOWN_ERR",
		"MALI_JOB_STATUS_END_SHUTDOWN",
		"MALI_JOB_STATUS_END_SYSTEM_UNUSABLE"
	};
	u32 tmp;
	u32 status_index = 0;

	tmp = job_stat>>16;
	while (tmp>>=1) status_index++;

	MALI_DEBUG_ASSERT_LEQ( status_index, (sizeof(job_verbose)/sizeof(char *))-1 );
	MALI_DEBUG_PRINT(0, ("jobstat: %d = %s \n", job_stat, job_verbose[status_index]));
}

#endif /* DEBUG */

#if MALI_USE_DEFERRED_FRAME_RESET
void _mali_frame_reset_deferred(mali_internal_frame *frame)
{
	MALI_DEBUG_ASSERT_POINTER( frame );

	_mali_frame_reset(frame);
	_mali_sys_lock_unlock(frame->lock);
}

MALI_STATIC void _mali_queue_frame_reset(mali_internal_frame *frame)
{
	mali_frame_builder *frame_builder;

	MALI_DEBUG_ASSERT_POINTER( frame );

#if MALI_INSTRUMENTED
	if (NULL != frame->instrumented_frame)
	{
		_instrumented_set_active_frame(frame->instrumented_frame);
	}
#endif

	frame_builder = frame->frame_builder;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	if (MALI_ERR_NO_ERROR != _mali_base_cleanup_thread_enqueue(frame_builder->base_ctx, MALI_REINTERPRET_CAST(mali_base_worker_task_proc)_mali_frame_reset_deferred, (void *)frame))
	{
		_mali_frame_reset_deferred(frame);
	}

#if MALI_INSTRUMENTED
	if (NULL != frame->instrumented_frame)
	{
		_instrumented_set_active_frame(NULL);
	}
#endif
}
#endif /* MALI_USE_DEFERRED_FRAME_RESET */

mali_ds_resource_handle _mali_frame_builder_surface_do_copy_on_write(void* resource_owner, void* consumer_owner)
{
	mali_ds_resource_handle retval;

	mali_surface_deep_cow_descriptor *cow_desc = NULL;
	mali_surface            *surface = (mali_surface*)resource_owner;
	mali_internal_frame     *frame   = (mali_internal_frame*)consumer_owner;

	/* Do we have to handle a deep copy later ? */
	if ( FRAME_COW_DEEP == frame->cow_flavour )
	{
		/* setup a read dependency on the old surface so that we don't start too early with the PP job */
		if ( MALI_ERR_NO_ERROR != mali_ds_connect(frame->ds_consumer_pp_render, surface->ds_resource, MALI_DS_READ) )
		{
			MALI_DEBUG_PRINT(1, ("FB CoW - Resource connection failed") );
			return NULL;
		}
		cow_desc = &frame->cow_desc;
		frame->cow_flavour = FRAME_COW_DEEP_COPY_PENDING;
	}

