NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	/* Re-allocate a new resource immediately and store the previous memory pointers for a copy operation later */
	_mali_surface_access_lock(surface);
	retval = _mali_surface_clear_dependencies( surface, cow_desc );
	_mali_surface_access_unlock(surface);

	/* In case the reallocation failed we abandon the DeepCOW too. */
	if ( NULL == retval && frame->cow_flavour == FRAME_COW_DEEP_COPY_PENDING )
	{
		frame->cow_flavour = FRAME_COW_REALLOC;
	}

	return retval;
}

MALI_STATIC mali_err_code _add_flush_dependencies_on_buffers(mali_internal_frame *frame, mali_frame_builder* fbuilder, mali_bool frame_swap)
{
	int i;
	mali_err_code err;

	/* The default framebuilder flush setting is the RELEASE_WRITE, READ_GOTO_UNFLUSHED mode.
	 * This mode must be set prior to all flushes (since it can be changed by incremental rendering),
	 * and this is a good place to set it. The RELEASE WRITE, READ_GOTO UNFLUSHED mode will release all
	 * write dependencies after the flush is over, but retain all read dependencies, returning them to unflushed
	 * mode.
	 *
	 * The exception is if this frame has been flagged with frame swap. In this case, no new flushes can occur,
	 * and as a result, all the frame dependencies will be released upon flush finished */
	if(frame_swap) {
		mali_ds_consumer_release_set_mode(frame->ds_consumer_pp_render, MALI_DS_RELEASE_ALL);
	} else {
		mali_ds_consumer_release_set_mode(frame->ds_consumer_pp_render, MALI_DS_RELEASE_WRITE_GOTO_UNFLUSHED);
	}

	for (i = 0; i < MALI200_WRITEBACK_UNIT_COUNT; ++i)
	{
		mali_surface *target_surface = fbuilder->output_buffers[i].buffer;
		if (NULL != target_surface)
		{
			/* Set up event callbacks if there is any event handler for the surface GPU WRITE DONE event */
			if(target_surface->eventfunc[MALI_SURFACE_EVENT_GPU_WRITE_DONE] != NULL)
			{
				/* adding the output buffer to surfacetracking */
				err = _mali_surfacetracking_add(frame->surfacetracking, target_surface, MALI_SURFACE_TRACKING_WRITE);
				if(MALI_ERR_NO_ERROR != err) return err;
			}

			/* add the surface memref to the frame, preventing the memref from vanishing before the frame is done */
			err = _mali_frame_builder_add_callback( fbuilder,
									          (mali_frame_cb_func)_mali_shared_mem_ref_owner_deref,
											  (mali_frame_cb_param) target_surface->mem_ref) ;
			if(MALI_ERR_NO_ERROR != err) return err;
			_mali_shared_mem_ref_owner_addref( target_surface->mem_ref );

			/* add write dependency. This must happen after the memory is addref'ed */
			err =  mali_ds_connect(frame->ds_consumer_pp_render, target_surface->ds_resource, MALI_DS_WRITE);
			if(MALI_ERR_NO_ERROR != err) return err;

		}
	}

#if MALI_FRAMEBUFFER_DUMP_ENABLED
	err = _mali_fbdump_setup_callbacks(fbuilder);		
	if(MALI_ERR_NO_ERROR != err) return err;
#endif


	return MALI_ERR_NO_ERROR;
}

MALI_EXPORT MALI_CHECK_RESULT mali_err_code _mali_frame_callback_list_set_room(mali_internal_frame *frame, int room)
{
	/* allocate more memory */
	mali_frame_callback_wrapper *new_list = _mali_sys_realloc(frame->callback_list,  sizeof(mali_frame_callback_wrapper) * room);
	if (NULL == new_list) return MALI_ERR_OUT_OF_MEMORY;

	/* update state */
	frame->callback_list_room = room;
	frame->callback_list = new_list;
	return MALI_ERR_NO_ERROR;
}

void null_callback(u32 dummy)
{
	MALI_IGNORE(dummy);
	return;
}

void _mali_frame_builder_frame_execute_callbacks_internal( mali_internal_frame *frame, mali_bool execute_deferred_callbacks )
{
	int i;
#if MALI_INSTRUMENTED
	mali_instrumented_frame* acquired_instrumented_frame = NULL;
#endif

	MALI_DEBUG_ASSERT_POINTER( frame );

	/* The callback list can be NULL if we failed to allocate it in _alloc_internal_frames */
	if( NULL == frame->callback_list ) return;
	
	if(!execute_deferred_callbacks && MALI_FALSE == frame->have_non_deferred_callbacks) return;

#if MALI_INSTRUMENTED
	if (NULL == _instrumented_get_active_frame())
	{
		if (NULL == frame->instrumented_frame)
		{
			/*
			 * There are currently no active frame and the framebuilder haven't setup a frame yet.
			 * Use the current frame as active frame for the callback.
			 * (the callback uses the active instrumented frame)
			 */
			acquired_instrumented_frame = _instrumented_acquire_current_frame();
			MALI_DEBUG_ASSERT_POINTER(acquired_instrumented_frame);
			_instrumented_set_active_frame(acquired_instrumented_frame);
		}
		else
		{
			_instrumented_set_active_frame(frame->instrumented_frame);
		}
	}
#endif

	if(execute_deferred_callbacks)
	{
		/* execute callbacks unconditionally */
		for (i = frame->callback_list_size -1 ; i >= 0; i--)
		{
			mali_frame_callback_wrapper *cb_wrapper = &frame->callback_list[i];
			(cb_wrapper->func)(cb_wrapper->param);
		}
	}
	else
	{
		/* execute only the ones that can't be deferred, we know we have some because of the above early out test */
		for (i = frame->callback_list_size -1 ; i >= 0; i--)
		{
			mali_frame_callback_wrapper *cb_wrapper = &frame->callback_list[i];
			if ( MALI_FALSE == cb_wrapper->can_be_deferred )
			{
			 	(cb_wrapper->func)(cb_wrapper->param);
			 	cb_wrapper->func = null_callback;
			 	cb_wrapper->can_be_deferred = MALI_TRUE;
			}
			 	
		}
		frame->have_non_deferred_callbacks = MALI_FALSE; 
	}

#if MALI_INSTRUMENTED
	_instrumented_set_active_frame(NULL); /* don't leave dangling pointers in TLS */
	if (NULL != acquired_instrumented_frame)
	{
		/* Release the reference we acquired */
		_instrumented_release_frame(acquired_instrumented_frame);
	}
#endif
	
	if ( MALI_FALSE == execute_deferred_callbacks ) return;

	/* if the list has grown too much, shrink it to reduce memory usage */
	if ((frame->callback_list_size > INITIAL_LIST_ROOM) && /* memory reallocation will fail if list size is 0. */
	    (frame->callback_list_room > frame->callback_list_size * 2) /* we allow 2x spillage since we grow by a factor of two */
	   )
	{
		mali_err_code err = _mali_frame_callback_list_set_room(frame, frame->callback_list_size);
		/* The error does not matter since we use realloc - and if realloc fails the existing buffer is untouched.
		 * That means we will continue to use the existing (larger) callback list.
		 */
		MALI_IGNORE(err);

