NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	}

	frame->callback_list_size = 0; /* reset the list-size */
	frame->have_non_deferred_callbacks = MALI_FALSE;
}

void _mali_frame_builder_frame_execute_callbacks( mali_internal_frame *frame )
{
   _mali_frame_builder_frame_execute_callbacks_internal( frame, MALI_TRUE );
}

#if MALI_EXTERNAL_SYNC

MALI_STATIC void _mali_frame_call_pp_job_start_callback(mali_internal_frame *frame, mali_bool success, mali_fence_handle fence)
{
	mali_frame_builder *frame_builder;
	MALI_DEBUG_ASSERT_POINTER( frame );
	frame_builder = frame->frame_builder;

	frame_builder->egl_funcptrs->_sync_notify_job_start(success, fence, frame->fence_sync);
	frame->fence_sync = NULL;

	if (NULL != frame->cb_func_pp_job_start)
	{
		frame->cb_func_pp_job_start(success, fence, frame->cb_param_pp_job_start);
		frame->cb_func_pp_job_start = NULL;
	}
}

#endif /* MALI_EXTERNAL_SYNC */

void _mali_frame_builder_frame_execute_callbacks_non_deferred( mali_internal_frame *frame )
{
	if ( MALI_TRUE == frame->have_non_deferred_callbacks )
	{
		_mali_frame_builder_frame_execute_callbacks_internal( frame, MALI_FALSE );
	}
}

MALI_STATIC_INLINE void _mali_frame_builder_set_consumer_errors_with_activate_pp( mali_internal_frame *frame )
{
	mali_ds_consumer_set_error( frame->ds_consumer_pp_render );

	/* This will call the activation callback for the frame.
	- Since it has an error state, this will call:
	_abort_pp_processing( frame, base_ctx ); */
#if MALI_INSTRUMENTED
	_instrumented_set_active_frame(frame->instrumented_frame);
#endif
	mali_ds_consumer_activation_ref_count_change( frame->ds_consumer_pp_render, MALI_DS_REF_COUNT_RELEASE );
#if MALI_INSTRUMENTED
	_instrumented_set_active_frame(NULL); /* Don't leave a dangling pointer */
#endif

}

MALI_STATIC_INLINE void _mali_frame_builder_set_consumer_errors_with_force_release_pp( mali_internal_frame *frame )
{
	mali_ds_consumer_set_error( frame->ds_consumer_pp_render );

	/* This will call the release callback for the frame. */
	mali_ds_consumer_release_all_connections( frame->ds_consumer_pp_render);

}

#if !defined(HARDWARE_ISSUE_3251)
MALI_STATIC_INLINE mali_err_code _mali_frame_plbu_heap_size_change( mali_base_ctx_handle base_ctx, mali_internal_frame* frame )
{
	MALI_DEBUG_ASSERT_POINTER( frame );

	if( NULL == frame->plbu_heap_held )
	{
		return MALI_ERR_NO_ERROR;
	}

	if( MALI_NO_HANDLE != frame->plbu_heap_held->plbu_heap )
	{
		if( frame->plbu_heap_held->use_count != 0)
		{
			u32 heap_size = 0;
			MALI_DEBUG_ASSERT_POINTER( frame->frame_builder );

			heap_size =	MAX(	MAX(frame->frame_builder->past_plbu_size[0], frame->frame_builder->past_plbu_size[1]),
						MAX(frame->frame_builder->past_plbu_size[2], frame->frame_builder->past_plbu_size[3]));

			heap_size = MAX(((u32)(heap_size+1023)/1024) * 1024, HEAP_DEFAULT_SIZE);

			if((u32) _mali_sys_abs(heap_size - frame->plbu_heap_held->init_size) < (frame->plbu_heap_held->init_size >> 4) )
			{
				_mali_mem_heap_reset(frame->plbu_heap_held->plbu_heap);
			}
			else
			{
				MALI_CHECK_NO_ERROR( _mali_mem_heap_resize( base_ctx, frame->plbu_heap_held->plbu_heap, heap_size ));
				frame->plbu_heap_held->init_size = heap_size;
			}
			frame->plbu_heap_held->use_count = 0;
		}
	}
	return MALI_ERR_NO_ERROR;
}
#endif

void _mali_frame_builder_activate_gp_consumer_callback ( mali_base_ctx_handle base_ctx, void * owner, mali_ds_error status )
{
	mali_internal_frame *frame = ( mali_internal_frame * ) owner;
	mali_gp_job_handle current_gp_job = frame->current_gp_job;
	mali_err_code error = MALI_ERR_FUNCTION_FAILED;  /* Set default value to error. */

	MALI_IGNORE( base_ctx );

        /* The codeblock below synchronizes the order of when the internal frame starts rendering.
           The code manipulates the order_synch variable in two different frames taking a mutex in the
           previous frame. This is necessary since there are codepaths that call this function or
           _mali_activate_gp_consumer_callback without taking the Dependency System mutex.
           This can cause r/w races on order_sync with _mali_activate_gp_consumer_callback */
	{
		mali_internal_frame * previous_frame;
		previous_frame = frame->order_synch.prev;
		if( NULL!=previous_frame )
		{
			_mali_sys_mutex_lock(previous_frame->order_synch.frame_order_mutex);

			MALI_DEBUG_ASSERT( NULL==previous_frame->order_synch.release_on_finish , ("Previous frame have already got a connection to this frame, missing cleanup in reset?"));

			if ( (MALI_TRUE == previous_frame->order_synch.in_flight) &&
				 (previous_frame->order_synch.swap_nr < frame->order_synch.swap_nr )
			   )
			{
				/* Adding one reference to the current frame activation count.
				(Same as the GP job does) The current frame will not be activated
				before previous rendering is finished. (and the GP job)*/
				mali_ds_consumer_activation_ref_count_change(frame->ds_consumer_pp_render, MALI_DS_REF_COUNT_GRAB);
				/* Setting this will tell the previous frame to decrement this frame
				activation ref count when it is finished */
				MALI_DEBUG_ASSERT( FRAME_RENDERING == previous_frame->state, ("Err: The previous frame %p is not rendering: state=%d.", previous_frame, previous_frame->state) );
				previous_frame->order_synch.release_on_finish = frame->ds_consumer_pp_render;
			}
			_mali_sys_mutex_unlock(previous_frame->order_synch.frame_order_mutex);
		}
	}
	MALI_DEBUG_PRINT(3, ("GPS[%d]", frame->order_synch.swap_nr));

#if !defined(HARDWARE_ISSUE_3251)
	/* On the flush on a frame after a complete reset (@see _mali_frame_builder_reset)
	 * we reset the PLBU heap.
	 */
	_mali_sys_mutex_lock( frame->mutex );

	if ( frame->plbu_heap_reset_on_job_start || (frame->num_flushes_since_reset == 1) )
	{
		if( MALI_ERR_NO_ERROR != _mali_frame_plbu_heap_size_change( base_ctx, frame ))
		{
			status = MALI_DS_ERROR;
		}
		else
		{
			_mali_frame_builder_update_heap_address( frame );
		}
		frame->plbu_heap_reset_on_job_start = MALI_FALSE;
	}

	_mali_sys_mutex_unlock( frame->mutex );
#endif

	switch (status)
	{
		case MALI_DS_OK:
#if MALI_PERFORMANCE_KIT
			if (mali_complete_jobs_instantly == -1)
			{
				mali_complete_jobs_instantly = (int)_mali_sys_config_string_get_s64("MALI_COMPLETE_JOBS_INSTANTLY", 0, 0, 1);
			}

			if (mali_complete_jobs_instantly == 1)
			{
				error = MALI_ERR_OUT_OF_MEMORY; /* don't start job and trigger cleanup */
			}
			else
			{
#if MALI_TIMELINE_PROFILING_ENABLED
				_mali_base_profiling_add_event(VR_PROFILING_EVENT_TYPE_SINGLE | VR_PROFILING_EVENT_CHANNEL_SOFTWARE | VR_PROFILING_EVENT_REASON_SINGLE_SW_GP_ENQUEUE, 0, 0, frame->frame_builder->identifier, frame->flush_id, 0);
#endif
				error = _mali_gp_job_start( current_gp_job, MALI_JOB_PRI_NORMAL );
			}
#else
#if MALI_TIMELINE_PROFILING_ENABLED
			_mali_base_profiling_add_event(VR_PROFILING_EVENT_TYPE_SINGLE | VR_PROFILING_EVENT_CHANNEL_SOFTWARE | VR_PROFILING_EVENT_REASON_SINGLE_SW_GP_ENQUEUE, 0, 0, frame->frame_builder->identifier, frame->flush_id, 0);
#endif
			error = _mali_gp_job_start( current_gp_job, MALI_JOB_PRI_NORMAL );
#endif
		break;
		case MALI_DS_ERROR:
			/* Free all resources and do nothing:
			 * This is a NOOP, since this is handled by the PP-consumer */

			/* Continue on to the error block below.*/
			break;
		default:
			return;
	}

