NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	if ( MALI_ERR_NO_ERROR != error )
	{
		mali_ds_consumer_handle ds_consumer_pp_render;

		/* grab the mutex again since we need to do more processing on the frame */
		_mali_sys_mutex_lock( frame->mutex );

		#if MALI_INSTRUMENTED
			_instrumented_gp_abort( frame->current_gp_job );
		#endif

		if( frame->reset_on_finish == MALI_FALSE )
		{
			_mali_gp_job_free( frame->gp_job );
		}
		frame->gp_job = frame->current_gp_job;

		/* Don't set error-state for the gp-consumer, this will happen when
		 * we activate the pp-consumer with an error set
		 */

		/* But set an error on the pp_render consumer */
		mali_ds_consumer_set_error( frame->ds_consumer_pp_render );

		/* Cache the consumer, so we can unlock the frame before we post the error */
		ds_consumer_pp_render = frame->ds_consumer_pp_render;

		/* ungrab the mutex again since we now are done changing the frame in this function */
		_mali_sys_mutex_unlock( frame->mutex );

		/* This will call the activation callback for the frame.
		- It will not start the PP jobs, since the error state is set on the consumer.
		- It will however wait with the callback until its dependencies are met, and previous
		frame is also finished. This is necessary to keep the ordering of events correct. */
#if MALI_INSTRUMENTED
		_instrumented_set_active_frame(frame->instrumented_frame);
#endif
		mali_ds_consumer_activation_ref_count_change( ds_consumer_pp_render, MALI_DS_REF_COUNT_RELEASE );
#if MALI_INSTRUMENTED
		_instrumented_set_active_frame(NULL); /* Don't leave a dangling pointer */
#endif

		/* We do deliberetely not return error, since the frame could considered started,
		but failed after it came into the dependency system, and will be swapped with
		an error state*/
	}
}

/**
 * Undo the work done in _alloc_internal_frames
 **/
MALI_STATIC void _free_internal_frames(mali_internal_frame **frame_array, u32 swap_count)
{
	u32 i;

	MALI_DEBUG_ASSERT_POINTER(frame_array);

	for( i = 0; i < swap_count; i++ )
	{
		mali_internal_frame *frame = frame_array[ i ];
		if( frame != NULL )
		{
			_mali_frame_free( frame );
			frame = NULL;
			frame_array[i] = NULL;
		}
	}
	_mali_sys_free( frame_array );
}


/**
 * Creates a number of mali_internal_frame structures and initializes them.
 * Only called when allocating a new frame_builder.
 * @param base_ctx The base context to use for mali resource allocations
 * @swap_count The number of frames to create ( == the number of entries in the buffer swap chain)
 * @return An array of pointers to the new frames
 */
MALI_STATIC mali_internal_frame **_alloc_internal_frames( mali_base_ctx_handle base_ctx,
                                                         mali_frame_builder *frame_builder,
                                                         u32 swap_count )
{
	u32                   i;
	mali_bool             init_succeeded;
	mali_internal_frame **frame_array;

	MALI_IGNORE(frame_builder);

	MALI_DEBUG_ASSERT_HANDLE( base_ctx );
	MALI_DEBUG_ASSERT( swap_count > 0, ("illegal swap count\n") );


	frame_array = (mali_internal_frame **) _mali_sys_calloc( swap_count, sizeof( mali_internal_frame *) );
	if( frame_array == NULL ) return NULL;

	init_succeeded = MALI_TRUE;
	for( i = 0; i < swap_count; i++ )
	{
		mali_internal_frame *frame = _mali_frame_alloc( base_ctx, frame_builder);
		frame_array[ i ] = frame;
		if (NULL == frame) init_succeeded = MALI_FALSE;
	}

    /* Internal frames finishing Out Of Order Protection */
	/* If swap_count is higher than one and all frame allocations so far are
	 * successful, we need to force ooo protection.  If the initialization
	 * failed, we will destroy the allocated frames anyway. */
	if ( swap_count > 1 && init_succeeded )
	{
		u32 last_idx = swap_count-1;
		/* Setting up the ooo protector in the frame */
		for( i = 0; i < swap_count; i++ )
		{
			mali_internal_frame *frame;
			frame = frame_array[ i ];
			frame->order_synch.prev =    (i!=0)     ? frame_array[ i-1 ] : frame_array[ last_idx ];
			frame->order_synch.next = (i!=last_idx) ? frame_array[ i+1 ] : frame_array[ 0 ];
			frame->order_synch.swap_nr           = 0;
			frame->order_synch.in_flight         = MALI_FALSE;
			frame->order_synch.release_on_finish = NULL;
		}
	}

	/* all allocations succeeded */
	if( init_succeeded == MALI_TRUE ) return frame_array;

	/* allocations failed, so we have to clean up */
	_free_internal_frames(frame_array, swap_count);
	return NULL;
}


MALI_STATIC void __m200_rsw_dummy( m200_rsw *rsw, u32 dummy_shader_addr, s32 first_instr_len )
{
	MALI_DEBUG_ASSERT_POINTER( rsw );
	MALI_DEBUG_ASSERT( dummy_shader_addr != 0, ("Invalid shader_addr\n" ) );
	MALI_DEBUG_ASSERT( first_instr_len > 0, ("Invalid first instruction length\n") );

	_mali_sys_memset( rsw, 0, sizeof( m200_rsw ) );
	__m200_rsw_encode( rsw, M200_RSW_MULTISAMPLE_WRITE_MASK, 0xf );
	__m200_rsw_encode( rsw, M200_RSW_MULTISAMPLE_GRID_ENABLE, 1 );
	__m200_rsw_encode( rsw, M200_RSW_SHADER_ADDRESS, dummy_shader_addr );
	__m200_rsw_encode( rsw, M200_RSW_HINT_NO_SHADER_PRESENT, 0 );
	__m200_rsw_encode( rsw, M200_RSW_ALLOW_EARLY_Z_AND_STENCIL_TEST, 1 );
	__m200_rsw_encode( rsw, M200_RSW_Z_COMPARE_FUNC, M200_TEST_ALWAYS_FAIL);
	__m200_rsw_encode( rsw, M200_RSW_STENCIL_FRONT_COMPARE_FUNC, M200_TEST_ALWAYS_FAIL);
	__m200_rsw_encode( rsw, M200_RSW_STENCIL_BACK_COMPARE_FUNC, M200_TEST_ALWAYS_FAIL);

	/* See P00086 5.1 The header which says 4:0 == 1st instruction word length, this needs
	to be encoded into the dummy program */
	#if defined(USING_MALI400) || defined(USING_MALI450)
	__m200_rsw_encode( rsw, M200_RSW_FIRST_SHADER_INSTRUCTION_LENGTH, 0 );
	#else
	__m200_rsw_encode( rsw, M200_RSW_FIRST_SHADER_INSTRUCTION_LENGTH, (u32)first_instr_len );
	#endif
}


/**
 * Init the required dummy RSW and insert it into the rsw cache.
 * This is allocated once and re-used over all frames in the framebuilder. 
 */
MALI_STATIC mali_err_code _mali_frame_builder_alloc_dummy_rsw( mali_frame_builder *frame_builder )
{
	static const u32     dummy_shader[] = { 0x00020425, 0x0000000C, 0x01E007CF, 0xB0000000, 0x000005F5 };
	m200_rsw dummy_rsw;

	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_DEBUG_ASSERT_POINTER( frame_builder->base_ctx );

	frame_builder->dummy_rsw_mem = _mali_mem_alloc( frame_builder->base_ctx, MALI_ALIGN(sizeof(m200_rsw), 64) + MALI_ALIGN(sizeof( dummy_shader ),64) , 64, MALI_PP_READ | MALI_CPU_WRITE );
	if(frame_builder->dummy_rsw_mem == MALI_NO_HANDLE) return MALI_ERR_OUT_OF_MEMORY;

	/* copy the dummy shader to mali mem and store the length of the first instruction */
	_mali_mem_write_cpu_to_mali_32( frame_builder->dummy_rsw_mem, MALI_ALIGN(sizeof(m200_rsw), 64), (void *)dummy_shader, sizeof( dummy_shader ),  sizeof( dummy_shader[0] ) );

	/* set the dummy shader parameters in the rsw and set the other default params */
	__m200_rsw_dummy(&dummy_rsw, _mali_mem_mali_addr_get( frame_builder->dummy_rsw_mem, MALI_ALIGN(sizeof(m200_rsw), 64)), dummy_shader[0] & 0x1f );

	/* copy the RSW to mali mem */
	_mali_mem_write_cpu_to_mali_32( frame_builder->dummy_rsw_mem, 0, dummy_rsw, sizeof(dummy_rsw), sizeof(m200_rsw));

	return MALI_ERR_NO_ERROR;
}

MALI_EXPORT mali_frame_builder *_mali_frame_builder_alloc(
	enum mali_frame_builder_type type,
	mali_base_ctx_handle base_ctx,
	u32 swap_count,
	enum mali_frame_builder_properties properties,
	egl_api_shared_function_ptrs *egl_funcptrs )
{
	s32                  i;
	u32                  heap_size;
	mali_err_code        error;
	mali_frame_builder  *frame_builder;

	MALI_DEBUG_ASSERT_HANDLE( base_ctx );
	MALI_DEBUG_ASSERT( swap_count > 0, ("Need a minimum swapcount of 1\n") );

