NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	/* allocate the frame_builder struct to initialize*/
	frame_builder = (mali_frame_builder *) _mali_sys_calloc( 1, sizeof( mali_frame_builder ) );

	if( NULL == frame_builder ) return NULL;

	/* set base ctx which will be used for all mali resource allocations */
	frame_builder->base_ctx                           = base_ctx;
	frame_builder->egl_funcptrs                       = egl_funcptrs;
	frame_builder->properties                         = properties;
	frame_builder->incremental_render_flush_threshold = INCREMENTAL_RENDERING_THRESHOLD;
	frame_builder->buffer_state_per_plane             = 0;
	frame_builder->preserve_multisample               = MALI_FALSE;

	/* Only allow a maximum of 2 PLBU-heaps, one for working with GP and one for working with PP */
	frame_builder->plbu_heap_count = MIN( 2, swap_count );

	/* set swap variables in frame builder */
	frame_builder->iframe_current = 0;
	frame_builder->iframe_count   = swap_count;

	/* alloc mali memory for dummy rsw + shader. They share one memblock, at 64 byte aligned offsets */
	error = _mali_frame_builder_alloc_dummy_rsw(frame_builder);
	if( error != MALI_ERR_NO_ERROR )
	{
		_mali_frame_builder_free( frame_builder );
		frame_builder = NULL;
		return NULL;
	}

#if HARDWARE_ISSUE_7320
	/* allocate flush commandlist for issue 7320 workaround */
	frame_builder->flush_commandlist_subroutine = _mali_frame_builder_create_flush_command_list_for_bug_7320( base_ctx );
	if ( frame_builder->flush_commandlist_subroutine == MALI_NO_HANDLE )
	{
		_mali_frame_builder_free( frame_builder );
		frame_builder = NULL;
		return NULL;
	}
#endif

	/* allocate and initialize the internal frames */
	frame_builder->curr_pp_split_count = _mali_pp_get_num_cores();
	frame_builder->iframes = _alloc_internal_frames( base_ctx, frame_builder, swap_count);
	if( frame_builder->iframes == NULL )
	{
		_mali_frame_builder_free( frame_builder );
		frame_builder = NULL;
		return NULL;
	}

	/* allocate and set up PLBU heaps */
	frame_builder->plbu_heap_current = 0;
	frame_builder->plbu_heaps = _mali_sys_calloc( frame_builder->plbu_heap_count, sizeof( mali_heap_holder ) );
	if ( NULL == frame_builder->plbu_heaps )
	{
		_mali_frame_builder_free( frame_builder );
		frame_builder = NULL;
		return NULL;
	}

	#if !defined(HARDWARE_ISSUE_3251)
	heap_size = (u32)_mali_sys_config_string_get_s64("MALI_FRAME_HEAP_SIZE", HEAP_DEFAULT_SIZE, 4096, HEAP_MAX_SIZE);
	if ( frame_builder->properties & MALI_FRAME_BUILDER_PROPS_NOT_ALLOCATE_HEAP ) 
	{
	 	#if defined(USING_MALI200) && (MALI200_HWVER == 0x0004)
		/* Can't have zero size heap on r0p4. See bugzilla 9379 */
		heap_size = 128;
		#else
		heap_size = 0;
		#endif
	}
	#endif
	
	for ( i = 0; i < (s32) frame_builder->plbu_heap_count; i++ )
	{
		frame_builder->plbu_heaps[i].plbu_ds_resource = mali_ds_resource_allocate( base_ctx, frame_builder, NULL );

		frame_builder->plbu_heaps[ i ].init_size		= heap_size;
		frame_builder->plbu_heaps[i].use_count			= 0;

		if ( MALI_NO_HANDLE == frame_builder->plbu_heaps[i].plbu_ds_resource )
		{
			_mali_frame_builder_free( frame_builder );
			frame_builder = NULL;
			return NULL;
		}

		if( 0 != heap_size )
		{
			#if !defined(HARDWARE_ISSUE_3251)
				frame_builder->plbu_heaps[ i ].plbu_heap = _mali_mem_heap_alloc( frame_builder->base_ctx, heap_size, HEAP_MAX_SIZE, HEAP_GROW_SIZE);
			#else
				frame_builder->plbu_heaps[ i ].plbu_heap = _mali_mem_alloc( frame_builder->base_ctx, heap_size, 1024, MALI_PP_READ | MALI_GP_WRITE );
			#endif
			if ( MALI_NO_HANDLE == frame_builder->plbu_heaps[ i ].plbu_heap )
			{
				_mali_frame_builder_free( frame_builder );
				frame_builder = NULL;
				return NULL;
			}
		}
	}

	/* no attachments at this point */
	_mali_sys_memset(frame_builder->output_buffers, 0, sizeof(frame_builder->output_buffers));

	/* In case we are working with FBOs, we set color, depth and stencil buffer state to UNDEFINED */ 
	if( MALI_FRAME_BUILDER_TYPE_GLES_FRAMEBUFFER_OBJECT == type )
	{
		frame_builder->buffer_state_per_plane = MALI_COLOR_PLANE_UNDEFINED | MALI_DEPTH_PLANE_UNDEFINED | MALI_STENCIL_PLANE_UNDEFINED;
	}

	/* intial scissor params */
	frame_builder->scissor.top = frame_builder->scissor.bottom = frame_builder->scissor.left = frame_builder->scissor.right = 0;
	frame_builder->vpbox.top   = frame_builder->vpbox.bottom   = frame_builder->vpbox.left   = frame_builder->vpbox.right   = 0.f;

	/* dimensions */
	frame_builder->tilebuffer_color_format = 0x00008888;

	/* Clear values */
	_mali_frame_builder_set_clear_value( frame_builder, MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_R, 0x0 );
	_mali_frame_builder_set_clear_value( frame_builder, MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_G, 0x0 );
	_mali_frame_builder_set_clear_value( frame_builder, MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_B, 0x0 );
	_mali_frame_builder_set_clear_value( frame_builder, MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_A, 0xFFFF );
	_mali_frame_builder_set_clear_value( frame_builder, MALI_FRAME_BUILDER_BUFFER_BIT_DEPTH, 0xFFFFFF );
	_mali_frame_builder_set_clear_value( frame_builder, MALI_FRAME_BUILDER_BUFFER_BIT_STENCIL, 0x0 );

	frame_builder->swap_performed = 0;

#if MALI_TIMELINE_PROFILING_ENABLED
	/* generate unique framebuilder ID */
	frame_builder->identifier = MAKE_FRAME_BUILDER_ID(type, _mali_base_frame_builder_id_get_new(frame_builder->base_ctx));

	/* initialize the flush id generator */
	frame_builder->flush_count = 0;
#endif

#if MALI_EXTERNAL_SYNC
	frame_builder->output_fence = MALI_FENCE_INVALID_HANDLE;
#endif /* MALI_EXTERNAL_SYNC */

	return frame_builder;
}

MALI_EXPORT void _mali_frame_builder_free( mali_frame_builder *frame_builder )
{
	u32 i;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	/* no leave trace for this one, as the frame builder will be gone then */

	_mali_frame_builder_wait_all( frame_builder );


#if MALI_EXTERNAL_SYNC
	if (MALI_FENCE_INVALID_HANDLE != frame_builder->output_fence)
	{
		mali_fence_release(frame_builder->output_fence);
		frame_builder->output_fence = MALI_FENCE_INVALID_HANDLE;
	}
#endif /* MALI_EXTERNAL_SYNC */


	/* deref attached surfaces */
	for ( i = 0; i < MALI200_WRITEBACK_UNIT_COUNT; i++ )
	{
		if(frame_builder->output_buffers[i].buffer)
		{
			_mali_surface_deref( frame_builder->output_buffers[i].buffer );
			frame_builder->output_buffers[i].buffer	= NULL;
		}
	}

