NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	/* free all internal frames. This implicitly also waits Mali processing to finish. */
	if( frame_builder->iframes != NULL )
	{
		_free_internal_frames(frame_builder->iframes, frame_builder->iframe_count);
		frame_builder->iframes = NULL;
	}

	/* free all heaps */
	if(NULL != frame_builder->plbu_heaps )
	{
		for(i = 0; i < frame_builder->plbu_heap_count; i++)
		{
			if( MALI_NO_HANDLE != frame_builder->plbu_heaps[ i ].plbu_heap )
			{
				_mali_mem_free( frame_builder->plbu_heaps[ i ].plbu_heap );
			}

	 		if( MALI_NO_HANDLE != frame_builder->plbu_heaps[ i ].plbu_ds_resource )
			{
				mali_ds_resource_release_connections( frame_builder->plbu_heaps[ i ].plbu_ds_resource, MALI_DS_RELEASE, MALI_DS_ABORT_ALL );
			}
		}
		_mali_sys_free( frame_builder->plbu_heaps );
		frame_builder->plbu_heaps = NULL;
	}
	
#if HARDWARE_ISSUE_7320
	/* free the flush command list subroutine */
	if ( frame_builder->flush_commandlist_subroutine != MALI_NO_HANDLE )
	{
		_mali_mem_free(frame_builder->flush_commandlist_subroutine);
		frame_builder->flush_commandlist_subroutine = MALI_NO_HANDLE;
	}
#endif

	/* Free the dummy RSW */
	if(frame_builder->dummy_rsw_mem != MALI_NO_HANDLE)
	{
		_mali_mem_free( frame_builder->dummy_rsw_mem );
		frame_builder->dummy_rsw_mem = MALI_NO_HANDLE;
	}

	/* deref attached surfaces */
	for ( i = 0; i < MALI_READBACK_SURFACES_COUNT; i++ )
	{
		if(frame_builder->readback_buffers[i].buffer)
		{
			_mali_surface_deref( frame_builder->readback_buffers[i].buffer );
			frame_builder->readback_buffers[i].buffer = NULL;
		}
	}

	/* free the frame builder */
	_mali_sys_free( frame_builder );
}

/**
 * Insert various dummy PLBU commands in the gp job.
 * The commands will be replaced by the right values inside __internal_flush.
 * Part of the once-per-frame GP init
 */
MALI_STATIC mali_err_code _mali_frame_builder_plbu_preinit( mali_internal_frame *frame )
{
	mali_gp_plbu_cmd* cmds;

	/* Init of viewportbox[] to stop an incorrect warning from Coverity as it doesn't handle unions correctly */
	union {
		float f;
		u32   i;
	} viewportbox[4] = { {0}, {0}, {0}, {0}};

	MALI_DEBUG_ASSERT_POINTER( frame );
	MALI_DEBUG_ASSERT_POINTER( frame->gp_job );

	/* try to get the cmd_list buffer directly */
	cmds = _mali_gp_job_plbu_cmds_reserve( frame->gp_job, 11 );

	/*store it for later */
	frame->pre_plbu_cmd_head = cmds;

    MALI_CHECK_NON_NULL(cmds, MALI_ERR_OUT_OF_MEMORY);

	/* Setting initial viewportbox
	 * Using unions since the binary representation of the floats have to be written to the PLBUs config registers
	 */
	viewportbox[ 0 ].f = 0.f;
	viewportbox[ 1 ].f = frame->vpbox.right;
	viewportbox[ 2 ].f = 0.f;
	viewportbox[ 3 ].f = frame->vpbox.bottom;

	cmds[ 5 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[0].i, GP_PLBU_CONF_REG_SCISSOR_LEFT );
	cmds[ 6 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[1].i, GP_PLBU_CONF_REG_SCISSOR_RIGHT );
	cmds[ 7 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[2].i, GP_PLBU_CONF_REG_SCISSOR_TOP );
	cmds[ 8 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[3].i, GP_PLBU_CONF_REG_SCISSOR_BOTTOM );

MALI_DEBUG_CODE(
	cmds[ 0 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( 1, GP_PLBU_CONF_REG_PARAMS);
	cmds[ 1 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( 2, GP_PLBU_CONF_REG_TILE_SIZE);
	cmds[ 2 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( 3, GP_PLBU_CONF_REG_VIEWPORT );
	cmds[ 3 ] = GP_PLBU_COMMAND_PREPARE_FRAME( 4 );
	cmds[ 4 ] = GP_PLBU_COMMAND_POINTER_ARRAY_BASE_ADDR_TILE_COUNT(0x5555dead, 0);
	cmds[ 9 ]  = GP_PLBU_COMMAND_WRITE_CONF_REG( 0xaaaadead, GP_PLBU_CONF_REG_HEAP_START_ADDR );
	cmds[ 10 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( 0xbbbbdead, GP_PLBU_CONF_REG_HEAP_END_ADDR );
)
	/* Commit the commands to the PLBU list */
	_mali_gp_job_plbu_cmds_confirm( frame->gp_job, 11 );


	return MALI_ERR_NO_ERROR;
}

/**
 * Insert various PLBU commands in the gp job to set up screen sizes etc.
 * Part of the once-per-frame GP init
 */
MALI_STATIC mali_err_code _mali_frame_builder_plbu_init( mali_internal_frame *frame )
{
	mali_gp_plbu_cmd* cmds;

	MALI_DEBUG_ASSERT_POINTER( frame );
	MALI_DEBUG_ASSERT_POINTER( frame->gp_job );
	MALI_DEBUG_ASSERT_POINTER( frame->tilelists);

	MALI_DEBUG_ASSERT(frame->job_inited == 1, ( "job not Inited in _mali_frame_builder_plbu_init") );

	/* try to get the cmd_list buffer directly */
	cmds = frame->pre_plbu_cmd_head;

    MALI_CHECK_NON_NULL(cmds, MALI_ERR_OUT_OF_MEMORY);

	/* the tile list scale must be set before any tile list commands are generated */
	cmds[ 0 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( MALI_TILELIST_CHUNK_FORMAT << 8, GP_PLBU_CONF_REG_PARAMS);

	/* tile binning downscale and polygon list primitve format */
	{
#if defined(USING_MALI200)
		cmds[ 1 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( GP_PLBU_CONF_REGS_TILE_SIZE(frame->tilelists->binning_scale_x, frame->tilelists->binning_scale_y), GP_PLBU_CONF_REG_TILE_SIZE);
#else
		cmds[ 1 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( GP_PLBU_CONF_REGS_TILE_SIZE_WITH_FORMAT(frame->tilelists->binning_scale_x, frame->tilelists->binning_scale_y, frame->tilelists->polygonlist_format), GP_PLBU_CONF_REG_TILE_SIZE);
#endif
	}

	/* starting from r0p2 the screen size is set using master tile dimensions */
	cmds[ 2 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( 0 | ( (frame->tilelists->master_tile_height - 1) << 8 ) | ( 0 << 16 ) |
	                                            ( (frame->tilelists->master_tile_width - 1) << 24 ), GP_PLBU_CONF_REG_VIEWPORT );

	/* width for tile iterator */
	cmds[ 3 ] = GP_PLBU_COMMAND_PREPARE_FRAME( frame->tilelists->slave_tile_width );

	/* load the pointer array into the PLBU */
	cmds[ 4 ] = GP_PLBU_COMMAND_POINTER_ARRAY_BASE_ADDR_TILE_COUNT( _mali_mem_mali_addr_get( frame->tilelists->pointer_array_mem, 0 ), frame->tilelists->tile_pointers_to_load );

	/* NOTE: cmds[5 to 8] are the initial viewport and are set in _mali_frame_builder_plbu_preinit */

	/* cmds [9 to 10] are the initial heap parameters, set in _mali_frame_builder_update_heap_address */
	MALI_DEBUG_ASSERT(frame->job_inited == 1, ( "mali_frame_builder_plbu_init job inited stage should be 1 but is %d", frame->job_inited) );
	frame->job_inited = 2;

	return MALI_ERR_NO_ERROR;
}

