NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
MALI_STATIC void _mali_frame_builder_update_heap_address( mali_internal_frame *frame )
{
	mali_gp_plbu_cmd* cmds;

	MALI_DEBUG_ASSERT_POINTER(frame);

	cmds = frame->pre_plbu_cmd_head;

	if( NULL != cmds )
	{
		if ( NULL != frame->plbu_heap_held && NULL != frame->plbu_heap_held->plbu_heap)
		{
#if !defined(HARDWARE_ISSUE_3251)
			cmds[ 9 ]  = GP_PLBU_COMMAND_WRITE_CONF_REG(  _mali_mem_heap_get_start_address( frame->plbu_heap_held->plbu_heap ), GP_PLBU_CONF_REG_HEAP_START_ADDR );
			cmds[ 10 ] = GP_PLBU_COMMAND_WRITE_CONF_REG(  _mali_mem_heap_get_end_address_of_first_block( frame->plbu_heap_held->plbu_heap ), GP_PLBU_CONF_REG_HEAP_END_ADDR );
#else
			cmds[ 9 ]  = GP_PLBU_COMMAND_WRITE_CONF_REG(  _mali_mem_mali_addr_get( frame->plbu_heap_held->plbu_heap, 0), GP_PLBU_CONF_REG_HEAP_START_ADDR );
			cmds[ 10 ] = GP_PLBU_COMMAND_WRITE_CONF_REG(  _mali_mem_mali_addr_get( frame->plbu_heap_held->plbu_heap, _mali_mem_size_get(frame->plbu_heap_held->plbu_heap) ), GP_PLBU_CONF_REG_HEAP_END_ADDR );
#endif
		}
		else
		{
			cmds[ 9 ]  = GP_PLBU_COMMAND_WRITE_CONF_REG(  0, GP_PLBU_CONF_REG_HEAP_START_ADDR );
			cmds[ 10 ] = GP_PLBU_COMMAND_WRITE_CONF_REG(  0, GP_PLBU_CONF_REG_HEAP_END_ADDR );
		}
	}

}


MALI_STATIC void _reset_scissor_and_viewport_state( mali_frame_builder *frame_builder )
{
	u32 width, height;

	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	width = frame_builder->output_width;
	height = frame_builder->output_height;

	frame_builder->scissor.left   = 0;
	frame_builder->scissor.top    = 0;
	frame_builder->scissor.right  = width - 1;
	frame_builder->scissor.bottom = height - 1;

	frame_builder->vpbox.left   = 0.f;
	frame_builder->vpbox.top    = 0.f;
	frame->vpbox.left   = 0.f;
	frame->vpbox.top    = 0.f;
#if HARDWARE_ISSUE_3396
	/* need the settings to be inclusive due to the interface change */
	frame_builder->vpbox.right  = (float) (width) - 0.001f;
	frame_builder->vpbox.bottom = (float) (height) - 0.001f;
	frame->vpbox.right  = (float) (width) - 0.001f;
	frame->vpbox.bottom = (float) (height) - 0.001f;
#else /* HARDWARE_ISSUE_3396 */
	frame_builder->vpbox.right  = (float) (width);
	frame_builder->vpbox.bottom = (float) (height);
	frame->vpbox.right  = (float) (width);
	frame->vpbox.bottom = (float) (height);
#endif /* HARDWARE_ISSUE_3396 */
}

/**
 * Per-frame GP initialization such as heap setup, pointer array init +++
 */
MALI_STATIC mali_err_code _mali_frame_builder_per_frame_gp_init_pre( mali_frame_builder *frame_builder )
{
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	/* finish the old frame id and get a new one */
	frame->frame_id = _mali_base_frame_id_get_new( frame_builder->base_ctx );

	/* reset the job so we're able to associate it with a new frame id */
	_mali_gp_job_reset( frame->gp_job );

	/* associating the gp job with the correct frame id */
	_mali_gp_job_set_frame_id( frame->gp_job, frame->frame_id );

	/* reset scissor params */
	_reset_scissor_and_viewport_state( frame_builder );

	MALI_CHECK_NO_ERROR(_mali_frame_builder_plbu_preinit(frame));

/*	MALI_DEBUG_ASSERT( frame->num_flushes_since_reset == 0, ("per_frame_gp_init_pre called twice"));*/

	frame->job_inited = 1;

	return MALI_ERR_NO_ERROR;
}

/**
 * GP initialization for the _internal_flush
 */
MALI_STATIC mali_err_code _mali_frame_builder_per_frame_gp_init( mali_frame_builder *frame_builder )
{
	mali_err_code err;
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	MALI_DEBUG_ASSERT(frame->job_inited == 1, ( "mali_frame_builder_per_frame_gp_init job init stage should be 1 but is %d\n", frame->job_inited) );

	/* associate the heap with the gp job */
	if( NULL != frame->plbu_heap_held && MALI_NO_HANDLE != frame->plbu_heap_held->plbu_heap )
	{
		_mali_gp_job_set_tile_heap( frame->gp_job, frame->plbu_heap_held->plbu_heap );
	}

	_mali_frame_builder_set_split_count( frame_builder, suggest_pp_split_count( frame_builder->output_width, frame_builder->output_height ) );

	/* Allocate the tilelists if not yet done or if sizes changed*/
	if(frame->tilelists == NULL ||
	   frame_builder->output_width != frame->tilelists->width ||
	   frame_builder->output_height != frame->tilelists->height ||
	   frame_builder->curr_pp_split_count != frame->tilelists->split_count)
	{
		if(frame->tilelists) _mali_tilelist_free(frame->tilelists);
		frame->tilelists = _mali_tilelist_alloc( frame_builder->output_width,
		                                         frame_builder->output_height,
		                                         frame_builder->curr_pp_split_count, 
		                                         frame_builder->base_ctx);
		if(!frame->tilelists) return MALI_ERR_OUT_OF_MEMORY;
	} else {
		/* reinitialize the pointer array */
		/* TODO: only legal if the tilelist is not in use!!! Verify this!*/
		err = _mali_tilelist_reset(frame->tilelists);
		if(err != MALI_ERR_NO_ERROR) return err;

		/* and maybe re-align the tilelists to work on a new splitcount */
		if(frame_builder->curr_pp_split_count != frame->tilelists->split_count)
		{
			err = _mali_tilelist_change_splitcount(frame->tilelists, frame_builder->curr_pp_split_count);
			if(err != MALI_ERR_NO_ERROR) return err;
		}
	}
	frame->curr_pp_split_count = frame_builder->curr_pp_split_count;

	/* tile list dimensions, pointer array, initial viewportbox and heap setup */
	MALI_CHECK_NO_ERROR(_mali_frame_builder_plbu_init( frame ));

	return MALI_ERR_NO_ERROR;
}

MALI_STATIC mali_err_code _mali_frame_builder_init_per_frame( mali_frame_builder *frame_builder )
{
	mali_internal_frame *frame;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_DEBUG_ASSERT(frame_builder->output_valid == MALI_TRUE, ("Framebuilder outputs set up incorrectly"));

	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	MALI_DEBUG_ASSERT( MALI_ERR_NO_ERROR != _mali_sys_mutex_try_lock(frame->mutex),
	                   ("frame->mutex not locked by caller!") );

	MALI_DEBUG_ASSERT( frame->state != FRAME_CLEAN,("FRAME_CLEAN state inside _mali_frame_builder_init_per_frame!"));
	MALI_DEBUG_ASSERT( frame->state != FRAME_UNMODIFIED,("FRAME_UNMODIFIED state inside _mali_frame_builder_init_per_frame!"));
	MALI_DEBUG_ASSERT( frame->state != FRAME_COMPLETE  ,("FRAME_COMPLETE state inside _mali_frame_builder_init_per_frame!"));

	/* do per-frame init if this is the first _use() after a reset */
	if( frame->state == FRAME_DIRTY)
	{
		mali_err_code err;
		MALI_DEBUG_ASSERT( frame->plbu_heap_held == NULL, ("Per frame init encountered a plbu_heap held by the frame!"));

		/* Swap around the plbu-heaps like we did with the frames, there might not be a 1-2-1 ratio of heaps vs frames */
		frame_builder->plbu_heap_current = (frame_builder->plbu_heap_current + 1 == frame_builder->plbu_heap_count ) ? 0 : frame_builder->plbu_heap_current + 1;
		frame->plbu_heap_held = &frame_builder->plbu_heaps[ frame_builder->plbu_heap_current ];

		frame->order_synch.swap_nr = frame_builder->swap_performed;
		MALI_DEBUG_ASSERT( NULL == frame->order_synch.release_on_finish , ("Err: The new and clean frame has an action pending.") );

		/* initialize plbu */
		err = _mali_frame_builder_per_frame_gp_init( frame_builder );
		if (err != MALI_ERR_NO_ERROR)
		{
			frame->plbu_heap_held = NULL;
			return err;
		}

