NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	}
	else
	{
		MALI_DEBUG_ASSERT( MALI_FALSE ,("Frame state inside _mali_frame_builder_init_per_frame is %d!", (int)frame->state ));
		return MALI_ERR_OUT_OF_MEMORY;
	}

	return MALI_ERR_NO_ERROR;
}

/**
 * Internals of the _mali_frame_builder_use() entrypoint.
 * Allocates and maps a frame pool if not yet done, and sets the frame to dirty. 
 * Also deals with automatic readbacks.
 *
 * Long term plan: honestly, this entire function should only happen as the first drawcall in the frame. 
 * We may want to rename it. 
 */
MALI_STATIC mali_err_code _frame_builder_use_internal( mali_frame_builder *frame_builder, mali_internal_frame *frame )
{

	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_DEBUG_ASSERT_POINTER( frame );

	/* early out for most common conditions */
	if( frame->state == FRAME_DIRTY && frame->pool_mapped )
	{
		return MALI_ERR_NO_ERROR;
	}

#if MALI_USE_DEFERRED_FRAME_RESET
	if (FRAME_COMPLETE == frame->state)
	{
		if (MALI_TRUE == frame->reset_on_finish)
		{
			_mali_sys_mutex_unlock(frame->mutex);
			_mali_frame_reset(frame);
			_mali_sys_mutex_lock(frame->mutex);
		}
	}
#endif /* MALI_USE_DEFERRED_FRAME_RESET */

	/* NOTE: The calling function _must_ hold the frame->mutex */
	MALI_DEBUG_ASSERT( MALI_ERR_NO_ERROR != _mali_sys_mutex_try_lock(frame->mutex),
	                   ("frame->mutex not locked by caller!") );

	/* Early out if dimensions are 0 */
	MALI_DEBUG_ASSERT(frame == GET_CURRENT_INTERNAL_FRAME( frame_builder ), ("frame builder use_internal frame is not the current frame!"));
	MALI_DEBUG_ASSERT(0 != frame_builder->output_valid,("USE'ing a framebuilder that is not valid"));

	/* do per-frame init if this is the first _use() after a reset */
	if( (frame->state == FRAME_CLEAN) ||
	    (frame->state == FRAME_UNMODIFIED))
	{
		_mali_frame_builder_per_frame_gp_init_pre(frame_builder);
	}

	/* make sure we have a mapped frame pool: a lot of things, including the vertices streams, will be allocated from the frame pool memory */
	if( !frame->pool_mapped )
	{
		/* map the mem pool */
		MALI_CHECK_NO_ERROR( _mali_mem_pool_map( &frame->frame_pool ) );
		frame->pool_mapped = MALI_TRUE;
	}

	/* A clean frame should not read back stuff, as it will destroy its clear values */
	if ( frame->state != FRAME_CLEAN )
	{
		int index;

		/* frame will soon contain unrendered primitives / unprocessed commands */
		frame->state = FRAME_DIRTY;

		/* Using readback_first_drawcall we make sure that we only do a readback the first time it hits per frame.
		 * This "frame" member is set to MALI_TRUE in _mali_frame_alloc and _mali_frame_reset. 
		 */
		if ( frame->readback_first_drawcall )
		{
			/* Do readback where necessary */
			for ( index = 0; index < MALI_READBACK_SURFACES_COUNT; index++ )
			{
				mali_err_code error;
				mali_surface* surface;
				u32 usage;
				surface = _mali_frame_builder_get_readback(frame_builder, index, &usage);
				if( surface == NULL) continue;

				error = _mali_frame_builder_readback( frame_builder, surface, usage, 0, 0, _mali_frame_builder_get_width( frame_builder ), _mali_frame_builder_get_height( frame_builder ) );
				if( MALI_ERR_NO_ERROR != error )
				{
					return error;
				}
			}
			frame->readback_first_drawcall = MALI_FALSE;
		}
	}
	
	/* frame will soon contain unrendered primitives / unprocessed commands */
	frame->state = FRAME_DIRTY;

	return MALI_ERR_NO_ERROR;
}

MALI_EXPORT mali_err_code _mali_frame_builder_use( mali_frame_builder *frame_builder )
{
	mali_internal_frame *frame;
	mali_err_code error = MALI_ERR_NO_ERROR;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_DEBUG_ASSERT(frame_builder->output_valid == MALI_TRUE, ("Framebuilder outputs set up incorrectly"));

	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	/* wait for current frame to finish any mali processing */
	_mali_frame_wait_and_take_mutex( frame );

	error = _frame_builder_use_internal( frame_builder, frame );
	_mali_sys_mutex_unlock( frame->mutex );

	if ( MALI_ERR_NO_ERROR != error )
	{
		return error;
	}

	MALI_SUCCESS;
}

MALI_EXPORT void _mali_frame_builder_clean( mali_frame_builder *frame_builder )
{
	u32 i;
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	/* wait for all mali hw processing of the frame to finish before taking the mutex*/
	_mali_frame_wait_and_take_mutex( frame );
	_mali_sys_mutex_unlock( frame->mutex );

	/* set the owners of each framebuilder attachment we are clearing. This prevents a future
	 * readback, overriding the clear */
	for (i = 0; i < MALI200_WRITEBACK_UNIT_COUNT; ++i)
	{
		u32 usage;
		mali_surface *surf = _mali_frame_builder_get_output(frame_builder, i, &usage);

		if (surf == NULL || (usage & MALI_OUTPUT_COLOR)) continue;

		_mali_surface_access_lock(surf);

		if (surf->flags & MALI_SURFACE_FLAG_READ_PENDING) 
		{
			_mali_surface_access_unlock(surf);
			continue;
		}

		if ((usage & MALI_OUTPUT_DEPTH) || (usage & MALI_OUTPUT_STENCIL))
		{
			_mali_frame_builder_discard_surface_write_back(frame_builder, surf, i);
		}

		_mali_surface_access_unlock(surf);
	}

	/* reset the frame. A full clean will remove (overwrite) all contents of the frame */
	_mali_frame_reset( frame );

	/* then set the frame state to CLEAN */
	frame->state = FRAME_CLEAN;

	/* fragment shader stack size */
	frame->fs_stack.start = 0;
	frame->fs_stack.grow  = 0;

	frame->plbu_heap_reset_on_job_start = MALI_TRUE;
	_mali_frame_set_inc_render_on_flush( frame_builder, MALI_FALSE );
}

MALI_EXPORT void _mali_frame_builder_set_clearstate( mali_frame_builder *frame_builder, u32 buffer_mask )
{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	/* Setting the cleared buffers specified in buffer_mask to the buffer state to "clear to current clear color" */
	if( buffer_mask & MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_ALL_CHANNELS )
	{
		frame_builder->buffer_state_per_plane &= ~MALI_COLOR_PLANE_MASK;
		frame_builder->buffer_state_per_plane |= MALI_COLOR_PLANE_CLEAR_TO_COLOR;
	}
	if( buffer_mask & MALI_FRAME_BUILDER_BUFFER_BIT_DEPTH )
	{
		frame_builder->buffer_state_per_plane &= ~MALI_DEPTH_PLANE_MASK;
 		frame_builder->buffer_state_per_plane |= MALI_DEPTH_PLANE_CLEAR_TO_COLOR;
	}
	if( buffer_mask & MALI_FRAME_BUILDER_BUFFER_BIT_STENCIL )
	{
		frame_builder->buffer_state_per_plane &= ~MALI_STENCIL_PLANE_MASK;
		frame_builder->buffer_state_per_plane |= MALI_STENCIL_PLANE_CLEAR_TO_COLOR;
	}
}

