NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
MALI_EXPORT u32 _mali_frame_builder_get_clearstate( mali_frame_builder *frame_builder )
{
	u32 bit_mask = 0;

	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	if( (frame_builder->buffer_state_per_plane & MALI_COLOR_PLANE_CLEAR_TO_COLOR) || (frame_builder->buffer_state_per_plane & MALI_COLOR_PLANE_UNDEFINED) ) 	bit_mask |= MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_ALL_CHANNELS;
	if( (frame_builder->buffer_state_per_plane & MALI_DEPTH_PLANE_CLEAR_TO_COLOR) || (frame_builder->buffer_state_per_plane & MALI_DEPTH_PLANE_UNDEFINED) ) 	bit_mask |= MALI_FRAME_BUILDER_BUFFER_BIT_DEPTH;
	if( (frame_builder->buffer_state_per_plane & MALI_STENCIL_PLANE_CLEAR_TO_COLOR) || (frame_builder->buffer_state_per_plane & MALI_STENCIL_PLANE_UNDEFINED) ) 	bit_mask |= MALI_FRAME_BUILDER_BUFFER_BIT_STENCIL;

	return bit_mask;
}

MALI_EXPORT void _mali_frame_builder_reset( mali_frame_builder *frame_builder )
{
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	/* wait for all mali hw processing of the frame to finish before taking the mutex*/
	_mali_frame_wait_and_take_mutex( frame );
	_mali_sys_mutex_unlock( frame->mutex );

	/* reset the frame */
	_mali_frame_reset( frame );

	/* fragment shader stack size */
	frame->fs_stack.start = 0;
	frame->fs_stack.grow  = 0;

	frame->plbu_heap_reset_on_job_start = MALI_TRUE;
	_mali_frame_set_inc_render_on_flush( frame_builder, MALI_FALSE );

	frame_builder->preserve_multisample = MALI_FALSE;
}

/**
 * Update the frame builders fragment stack allocation, i.e. grow or shrink the existing stack buffer
 * depending on the requirements of the current frame.
 * Called once per frame.
 */
MALI_STATIC mali_err_code _fragment_stack_alloc( mali_frame_builder *frame_builder )
{
	int                  stack_entries, stack_size, prev_stack_size, num_stacks;
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	/* total number of stack entries needed */
	stack_entries = frame->fs_stack.start + frame->fs_stack.grow;

	if( 0 == stack_entries )
	{
		/* no stack needed. Free any existing stack mem and return */
		_mali_mem_free( frame->fs_stack.fs_stack_mem );
		frame->fs_stack.fs_stack_mem = MALI_NO_HANDLE;

		return MALI_ERR_NO_ERROR;
	}

#if defined(USING_MALI450)
	/* one stack per core */
	num_stacks = _mali_pp_get_num_cores();
#else
	/* one stack per master tile list */
	num_stacks = frame_builder->curr_pp_split_count;
#endif /* defined(USING_MALI450) */

	/* each stack entry is 8bytes and we have 128 threads */
	stack_size = stack_entries * 8 * 128 * num_stacks;

	/* get the size of the already allocated stack */
	prev_stack_size = ( MALI_NO_HANDLE == frame->fs_stack.fs_stack_mem ) ? 0 : _mali_mem_size_get( frame->fs_stack.fs_stack_mem );

	/* if the new stack is larger than the old, or less than 50% of the old size, we allocate a new */
	if( (stack_size > prev_stack_size) || (prev_stack_size > 2*stack_size) )
	{
		/* free old */
		_mali_mem_free( frame->fs_stack.fs_stack_mem );
		frame->fs_stack.fs_stack_mem = MALI_NO_HANDLE;

		/* allocate new */
		frame->fs_stack.fs_stack_mem = _mali_mem_alloc( frame_builder->base_ctx, stack_size, 64, MALI_PP_READ | MALI_PP_WRITE );
		if ( MALI_NO_HANDLE == frame->fs_stack.fs_stack_mem ) return MALI_ERR_OUT_OF_MEMORY;
	}

	return MALI_ERR_NO_ERROR;
}


/**
 * Sets the writeback "clip" box in the registers of a pp_job
 */
MALI_STATIC void _set_writeback_bounding_box( mali_pp_job_handle pp_job, u32 width, u32 height )
{
	MALI_DEBUG_ASSERT_HANDLE( pp_job );
	MALI_DEBUG_ASSERT( (width != 0) && (height != 0), ("zero-sized buffers not allowed\n") );
	/* assuring that the sizes are within the limits set in 3.5.11 and .12 of the M200 TRM */
	MALI_DEBUG_ASSERT( (width & ~((1<<14)-1)) == 0, ("width too large\n") );
	MALI_DEBUG_ASSERT( (height & ~((1<<14)-1)) == 0, ("height too large\n") );

	_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_BOUNDING_BOX_LEFT_RIGHT, width-1);
	_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_BOUNDING_BOX_BOTTOM,     height-1);
}

/**
 * Converts a usage containing multiple MALI_OUTPUT_DOWNSCALE bits set, to scale factor fitting a WBX AA_FORMAT register value
 *
 * Example:
 * MALI_OUTPUT_DOWNSAMPLE_X_2X | MALI_OUTPUT_DOWNSAMPLE_Y_2X ==> M200_WBx_AA_FORMAT_4X (aka 2)
 *
 */
MALI_STATIC u32 usage_to_wbx_register_aa_format( u32 usage )
{
	u32 x = 0;
	u32 y = 0;

	MALI_DEBUG_ASSERT(
	   (!! (usage & MALI_OUTPUT_DOWNSAMPLE_X_2X )) +
	   (!! (usage & MALI_OUTPUT_DOWNSAMPLE_X_4X )) +
	   (!! (usage & MALI_OUTPUT_DOWNSAMPLE_X_8X ))  <= 1, ("Only one x scale bit may be set!"));
	MALI_DEBUG_ASSERT(
	   (!! (usage & MALI_OUTPUT_DOWNSAMPLE_Y_2X )) +
	   (!! (usage & MALI_OUTPUT_DOWNSAMPLE_Y_4X )) +
	   (!! (usage & MALI_OUTPUT_DOWNSAMPLE_Y_8X )) +
	   (!! (usage & MALI_OUTPUT_DOWNSAMPLE_Y_16X )) <= 1, ("Only one y scale bit may be set!"));

	/* fill out log2 scale factors for x and y */
	if(usage & MALI_OUTPUT_DOWNSAMPLE_X_2X) x=1;
	if(usage & MALI_OUTPUT_DOWNSAMPLE_X_4X) x=2;
	if(usage & MALI_OUTPUT_DOWNSAMPLE_X_8X) x=3;
	if(usage & MALI_OUTPUT_DOWNSAMPLE_Y_2X) y=1;
	if(usage & MALI_OUTPUT_DOWNSAMPLE_Y_4X) y=2;
	if(usage & MALI_OUTPUT_DOWNSAMPLE_Y_8X) y=3;
	if(usage & MALI_OUTPUT_DOWNSAMPLE_Y_16X) y=4;


#if defined(USING_MALI400) || defined(USING_MALI450)
	/* mali400 support any combination of these */
	return (x << 8) | (y << 12);
#endif
#ifdef USING_MALI200
	/* mali200 defines the last 3 bits according to these rules:
	 * (Taken from the TRM, under the AA_FORMAT register state)
	 *
	 *  AA format       AA_X   AA_Y
	 *  ---------------------------
	 *          0          0      0
	 *          1          0      1
	 *          2          1      1
	 *          3          1      2
	 *          4          2      2
	 *          5          2      3
	 *          6          3      3
	 *          7          3      4
	 *
	 * This means aa_format = aa_x + aa_y, but with some heavy combination limits:
	 * (aa_y - aa_x) must be 0 or 1.
	 */
	MALI_DEBUG_ASSERT( (y - x == 1) || (y - x == 0), ("M200 impose limits of AA differences"));
	return x + y;
#endif

