NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
}


/**
 * Configures one of Mali200s writeback units by setting register values in a pp_job based on render
 * attachment settings.
 * Called once for each writeback unit (3) per frame.
 * @param render_attachment is the governing render attachment for this writeback unit, it is allowed to be NULL
 */
MALI_STATIC u32 _writeback_unit_setup( mali_pp_job_handle           pp_job,
                                       u32                          wb_unit,
                                       struct mali_surface         *render_target,
									   u32                          usage,
                                       mali_bool                    enable_bbox )
{
	u32                                   aa_format = 0;
	u32                                   fb_ptr, wb_flags = 0;

	MALI_DEBUG_ASSERT_HANDLE( pp_job );
	MALI_DEBUG_ASSERT_RANGE( (int)wb_unit, 0, 2 );

	if( render_target == NULL )
	{
		_m200_wb_reg_write( pp_job, wb_unit, M200_WBx_REG_SOURCE_SELECT, M200_WBx_SOURCE_NONE );
		return wb_unit;
	}

	_mali_surface_access_lock( render_target );

#if HARDWARE_ISSUE_4582
	/* layout INTERLEAVED BLOCKS does not support a bounding box, and it must be disabled for this rendertarget */
	if( render_target->format.pixel_layout == MALI_PIXEL_LAYOUT_INTERLEAVED_BLOCKS ) enable_bbox = MALI_FALSE;
#endif

	/* find aa format. */
	aa_format = usage_to_wbx_register_aa_format(usage);

	fb_ptr = (u32) _mali_mem_mali_addr_get( render_target->mem_ref->mali_memory, render_target->mem_offset );
	MALI_DEBUG_ASSERT_ALIGNMENT( fb_ptr, 8 ); /* the WBx unit requires this alignment */
	MALI_DEBUG_ASSERT_ALIGNMENT( fb_ptr, MALI200_SURFACE_ALIGNMENT); /* but all read surfaces requires this alignment */

	_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_TARGET_ADDR,   fb_ptr);
	_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_TARGET_LAYOUT, render_target->format.pixel_layout );

	if( MALI_PIXEL_LAYOUT_INTERLEAVED_BLOCKS == render_target->format.pixel_layout )
	{
		/* in block-interleaved mode scanline length = number of blocks */
		_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_TARGET_SCANLINE_LENGTH, (render_target->format.width + 0xf) >> 4 );
	}
	else
	{
		MALI_DEBUG_ASSERT(render_target->format.pixel_layout == MALI_PIXEL_LAYOUT_LINEAR, ("The only 'else' part we have is linear mode"));
		MALI_DEBUG_ASSERT(MALI200_SURFACE_PITCH_ALIGNMENT_LINEAR_LAYOUT % 8 == 0, ("MALI200_SURFACE_PITCH_ALIGNMENT_LINEAR_LAYOUT must be divisible by 8 on M200"));
		_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_TARGET_SCANLINE_LENGTH, render_target->format.pitch / 8);
	}

	_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_TARGET_AA_FORMAT,    aa_format);
	_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_TARGET_PIXEL_FORMAT, render_target->format.pixel_format);

	MALI_DEBUG_ASSERT( usage & (MALI_OUTPUT_COLOR | MALI_OUTPUT_DEPTH | MALI_OUTPUT_STENCIL), ("At least one MALI_OUTPUT usage bit must be set"));
	MALI_DEBUG_ASSERT(
		!!(usage & (MALI_OUTPUT_COLOR)) +
		!!(usage & (MALI_OUTPUT_DEPTH | MALI_OUTPUT_STENCIL))
		< 2, ("Either COLOR or DEPTH/STENCIL must be set"));

	if(usage & MALI_OUTPUT_COLOR)
	{
		_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_SOURCE_SELECT, M200_WBx_SOURCE_ARGB);
	} else {
		_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_SOURCE_SELECT, M200_WBx_SOURCE_Z_STENCIL);
	}

	if ( render_target->format.red_blue_swap )
	{
		wb_flags |= M200_WBx_TARGET_FLAGS_SWAP_RED_BLUE_ENABLE;
	}
	if ( render_target->format.reverse_order )
	{
		wb_flags |= M200_WBx_TARGET_FLAGS_INV_COMPONENT_ORDER_ENABLE;
	}
	if ( usage & MALI_OUTPUT_WRITE_DIRTY_PIXELS_ONLY )
	{
		wb_flags |= M200_WBx_TARGET_FLAGS_DIRTY_BIT_ENABLE;
	}

	if( enable_bbox ) wb_flags |= M200_WBx_TARGET_FLAGS_BOUNDING_BOX_ENABLE;

	_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_TARGET_FLAGS, wb_flags);
	_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_GLOBAL_TEST_ENABLE, 0);

	if ( !(usage & MALI_OUTPUT_MRT) )
	{
		/* No MRT so disable it */
		_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_MRT_ENABLE, 0);
	}
	else
	{
		/* Set up multiple render targets (MRT) */
		u32 offset = render_target->datasize;
		u32 mrt_mask = 0xF; /* enable all four outputs */

		_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_MRT_ENABLE, mrt_mask);
		_m200_wb_reg_write(pp_job, wb_unit, M200_WBx_REG_MRT_OFFSET, offset);
	}
	_mali_surface_access_unlock(render_target);

	return wb_unit + 1;
}

/**
 * Sets all the pp_job registers that depend on render_attachment settings (clear values,
 * framebuffer formats, dimensions etc).
 * Called once per frame.
 */
MALI_STATIC void _render_attachment_setup( mali_frame_builder          *frame_builder,
                                                mali_pp_job_handle           pp_job )
{
	mali_bool use_bbox;
	u32       next_unused_wb_unit = 0;
	u32       i;

	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	MALI_DEBUG_ASSERT_HANDLE( pp_job );

	/* set the different clear values in the pp job registers */
	if(_mali_frame_builder_get_fp16_flag (frame_builder) )
	{
		/* In FP16 mode, the first two of the four clear values hold the FP16 clear value for all channels.
		 * Note that the value in color_clear_value is already a FP16 bitvalue in this case. */
		u32 rg_color = (frame_builder->color_clear_value[0]) | (frame_builder->color_clear_value[1] << 16);
		u32 ba_color = (frame_builder->color_clear_value[2]) | (frame_builder->color_clear_value[3] << 16);

		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ABGR_CLEAR_VALUE_0,  rg_color);
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ABGR_CLEAR_VALUE_1,  ba_color);
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ABGR_CLEAR_VALUE_2,  0x0);
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ABGR_CLEAR_VALUE_3,  0x0);
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_Z_CLEAR_VALUE,       frame_builder->depth_clear_value );
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_STENCIL_CLEAR_VALUE, frame_builder->stencil_clear_value );
	} else {
		/* In non-FP16 mode, the four clear colors each set the clear color of a subsample. 
		 * Each setter accepts an u32 value holding 8 bits of each channel.
		 * Note that the value in color_clear_value is a 16bit value in this case.
		 * It must be shifted down by 8 bits to fit. */
		u32 color =   (((frame_builder->color_clear_value[0] >> 8) & 0xFF)      )     /* red */
		            | (((frame_builder->color_clear_value[1] >> 8) & 0xFF) << 8 )     /* green */
		            | (((frame_builder->color_clear_value[2] >> 8) & 0xFF) << 16)     /* blue */
		            | (((frame_builder->color_clear_value[3] >> 8) & 0xFF) << 24)     /* alpha */
					;
	
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ABGR_CLEAR_VALUE_0,  color);
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ABGR_CLEAR_VALUE_1,  color);
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ABGR_CLEAR_VALUE_2,  color);
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ABGR_CLEAR_VALUE_3,  color);
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_Z_CLEAR_VALUE,       frame_builder->depth_clear_value );
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_STENCIL_CLEAR_VALUE, frame_builder->stencil_clear_value );
	}

	use_bbox = frame_builder->bounding_box_used;

