NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	if( use_bbox ) _set_writeback_bounding_box( pp_job, frame_builder->bounding_box_width, frame_builder->bounding_box_height);

	/* set up the 3 writeback units.  We always use the writeback units in order (wb0 before wb1, etc.) */
	for ( i=0; i < MALI200_WRITEBACK_UNIT_COUNT; i++ )
	{
		mali_surface* surface = frame_builder->output_buffers[i].buffer;
		u32 usage = frame_builder->output_buffers[i].usage;

		mali_bool use_bbox_local = frame_builder->bounding_box_enable[i] & use_bbox;

		#if HARDWARE_ISSUE_4472
		if( usage & (
		    MALI_OUTPUT_DOWNSAMPLE_X_2X |
			MALI_OUTPUT_DOWNSAMPLE_X_4X |
			MALI_OUTPUT_DOWNSAMPLE_X_8X |
			MALI_OUTPUT_DOWNSAMPLE_Y_2X |
			MALI_OUTPUT_DOWNSAMPLE_Y_4X |
			MALI_OUTPUT_DOWNSAMPLE_Y_8X |
			MALI_OUTPUT_DOWNSAMPLE_Y_16X
			       )
		  )
		{
			use_bbox_local = MALI_FALSE;
		}
		#endif

		next_unused_wb_unit = _writeback_unit_setup( pp_job,
		                                             next_unused_wb_unit,
													 surface, usage,
		                                             use_bbox_local);
	}

	MALI_DEBUG_ASSERT_RANGE( (int)next_unused_wb_unit, 0, 3 );

}



/**
 * Set all pp_job registers necessary to render a frame.
 * Called once per frame.
 */
MALI_STATIC void _pp_job_setup_specific_registers(mali_internal_frame *frame, mali_pp_job_handle pp_job, int job_index)
{
	MALI_DEBUG_ASSERT_POINTER( frame );
	MALI_DEBUG_ASSERT_POINTER( frame->tilelists );
	MALI_DEBUG_ASSERT_HANDLE( pp_job );
	MALI_DEBUG_ASSERT_RANGE( job_index, 0, MALI_MAX_PP_SPLIT_COUNT - 1 );

/* DLBU used instead of master tile list for Mali-450 */
#if !defined(USING_MALI450)
	/* set master tile list */
	_m200_frame_reg_write_specific(pp_job,
		job_index,
		M200_FRAME_REG_REND_LIST_ADDR,
		_mali_mem_mali_addr_get(frame->tilelists->master_tile_list_mem, frame->tilelists->pp_master_tile_list_offsets[job_index] * sizeof(mali_tilelist_cmd))
	);
#endif /* !defined(USING_MALI450) */

	/* set fragment stack address */
	if ( MALI_NO_HANDLE != frame->fs_stack.fs_stack_mem )
	{
		int stack_entries = frame->fs_stack.start + frame->fs_stack.grow;
		int stack_size = stack_entries * 8 * 128;

		_m200_frame_reg_write_specific(
			pp_job,
			job_index,
			M200_FRAME_REG_FS_STACK_ADDR,
			_mali_mem_mali_addr_get( frame->fs_stack.fs_stack_mem, stack_size * job_index)
		);

		/* @@@@ Really a common, but falls under the if test, so best kept here to avoid multiple if tests? */
		_m200_frame_reg_write_common(
			pp_job,
			M200_FRAME_REG_FS_STACK_SIZE_AND_INIT_VAL,
			( frame->fs_stack.start << 16 ) | (frame->fs_stack.start + frame->fs_stack.grow)
		);
	}
}

MALI_STATIC void _pp_job_setup_common_registers( mali_frame_builder *frame_builder, mali_internal_frame *frame, mali_pp_job_handle pp_job )
{
	MALI_DEBUG_ASSERT_POINTER( frame );
	MALI_DEBUG_ASSERT_HANDLE( pp_job );

	/* setup render attachments */
	_render_attachment_setup(frame_builder, pp_job);

	/* set rsw base */
	_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_REND_RSW_BASE, _mali_mem_mali_addr_get( frame_builder->dummy_rsw_mem, 0) );

	{
		mali_bool earlyz_enable = MALI_TRUE;
		mali_bool earlyz_disable2 = MALI_FALSE;

#if HARDWARE_ISSUE_4924
		earlyz_enable = MALI_FALSE;
#endif

#if HARDWARE_ISSUE_3781
		earlyz_disable2 = MALI_TRUE;
#endif
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_FEATURE_ENABLE,
			((frame_builder->properties & MALI_FRAME_BUILDER_PROPS_ORIGO_LOWER_LEFT) ? M200_FEATURE_ORIGIN_LOWER_LEFT : 0) |
			(earlyz_enable ? M200_FEATURE_EARLYZ_ENABLE :  0) |
			(earlyz_disable2 ? M200_FEATURE_EARLYZ_DISABLE2 : 0) |
			(_mali_frame_builder_get_fp16_flag (frame_builder) ? M200_FEATURE_FP_TILEBUF_ENABLE : 0)
		);
#if !defined(USING_MALI200)
		/*
		** Mali-400 MP introduced HW fixes, so we don't need SW workarounds:
		** M400_SCALING_CONFIG_FLIP_FRAGCOORD - this is actually the same as M200_FEATURE_ORIGIN_LOWER_LEFT above
		** M400_SCALING_CONFIG_FRAGCOORD_SCALE_ENABLE - instead of workaround for bugzilla 4374 (gl_mali_FragCoordScale)
		** M400_SCALING_CONFIG_FLIP_POINT_SPRITES - instead of workaround for bugzilla 3823 (gl_mali_PointCoordScaleBias)
		** M400_SCALING_CONFIG_DERIVATIVE_SCALE_ENABLE - instead of workaround for bugzilla 4658 (gl_mali_DerivativeScale)
		** M400_SCALING_CONFIG_FLIP_DERIVATIVE_Y - instead of workaround for bugzilla 4658 (gl_mali_DerivativeScale)
		*/

		/* Note: The scalefactor is pulled from the largest WBx scalefactor. For regular use-cases, this makes sense
		 * as all targets will carry the same supersample factor. If you ever figure that this should rather be
		 * the common ground or something, feel free to do so. */

		MALI_DEBUG_ASSERT( frame_builder->output_log2_scale_x < 8, ("x scale factor too large!") );
		MALI_DEBUG_ASSERT( frame_builder->output_log2_scale_y < 8, ("y scale factor too large!") );

		_m200_frame_reg_write_common(pp_job, M400_FRAME_REG_SCALING_CONFIG,
			(frame_builder->output_log2_scale_x << 16) |
			(frame_builder->output_log2_scale_y << 20) |
			M400_SCALING_CONFIG_FRAGCOORD_SCALE_ENABLE |
			M400_SCALING_CONFIG_DERIVATIVE_SCALE_ENABLE |
			((frame_builder->properties & MALI_FRAME_BUILDER_PROPS_ORIGO_LOWER_LEFT) ? M400_SCALING_CONFIG_FLIP_FRAGCOORD | M400_SCALING_CONFIG_FLIP_DERIVATIVE_Y : M400_SCALING_CONFIG_FLIP_POINT_SPRITES)
		);
#endif
	}

#if HARDWARE_ISSUE_4490
	/* set the subpixel specifier to 4 bit */
	_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_SUBPIXEL_SPECIFIER, 127-4 );
#else
	/* set the subpixel specifier to the highest value that is guaranteed to work in all resolutions; 8 bits */
	_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_SUBPIXEL_SPECIFIER, 127-8 );
#endif

	/* Set the pixel center for the Position Register operation to ( 0.5, height - 0.5) for OpenGLES according to 3.4.17 of M200 TRM */
	{
		/* fix for defect 4374 - the offset must be set to height -0.5, but height is given by the supersample factor */
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ORIGIN_OFFSET_X, 1 );
		_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_ORIGIN_OFFSET_Y,
			(frame_builder->properties & MALI_FRAME_BUILDER_PROPS_ORIGO_LOWER_LEFT) ? (2*frame_builder->output_height)-1 : 1
		);
	}

