NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	_m200_frame_reg_write_common(pp_job, M200_FRAME_REG_TIEBREAK_MODE, (frame_builder->properties & MALI_FRAME_BUILDER_PROPS_ORIGO_LOWER_LEFT) ? 1 : 0);

#if !defined(USING_MALI200)
	MALI_DEBUG_ASSERT_POINTER( frame->tilelists );
	/* set up tile list primitive format, must match what is used by the PLBU */
	_m200_frame_reg_write_common(pp_job, M400_FRAME_REG_PLIST_CONFIG,
	                               GP_PLBU_CONF_REGS_TILE_SIZE_WITH_FORMAT(frame->tilelists->binning_scale_x, frame->tilelists->binning_scale_y, frame->tilelists->polygonlist_format));

	/* set up tilebuffer format to match output format. This means the per-primitive dithering targets the right color space. */
	{
		int i;
		for ( i = 0; i < MALI200_WRITEBACK_UNIT_COUNT; i++)
		{
			struct mali_surface* render_target = frame_builder->output_buffers[i].buffer;
			u32 usage = frame_builder->output_buffers[i].usage;

			/* use the format of the first color target in the writeback units */
			if(	render_target && ( MALI_OUTPUT_COLOR & usage ) )
			{
				/* the default tilebuffer format is 8888 */
				u32 code = 0x00008888;
#if 1
				/* Handling the correct tile buffers for dithering */
				switch (render_target->format.pixel_format)
				{
					case	MALI_PIXEL_FORMAT_R5G6B5:
						code = 0x00008565;
						break;
					case	MALI_PIXEL_FORMAT_A1R5G5B5:
						code = 0x00008555;
						break;
					case	MALI_PIXEL_FORMAT_A4R4G4B4:
						code = 0x00008444;
						break;
					default:
						;
				}
#endif
				frame_builder->tilebuffer_color_format = code;
				_m200_frame_reg_write_common(pp_job, M400_FRAME_REG_TILEBUFFER_BITS, code);
				break;
			}
		}
	}
#endif
}

/**
 * Store the necessary PLBU state data so that a later gp_job can continue working where the current
 * job left off.
 * Called once for each "incremental render", i.e. when M200 is set up to render the tile lists that
 * have been produced so far, before we continue building on the same lists.
 */
MALI_STATIC mali_err_code _gp_job_context_switch_out( mali_frame_builder *frame_builder, mali_gp_job_handle gp_job )
{
	mali_mem_handle  stack;
	mali_gp_plbu_cmd* cmds;
	u32 cmd_index = 0;

#if HARDWARE_ISSUE_7320
#define MAX_NUM_CMDS (12 + (2*HARDWARE_ISSUE_7320_OUTSTANDING_WRITES))
#else
#define MAX_NUM_CMDS 12
#endif


	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_DEBUG_ASSERT_HANDLE( gp_job );

	cmds = _mali_gp_job_plbu_cmds_reserve( gp_job, MAX_NUM_CMDS );

    MALI_CHECK_NON_NULL(cmds, MALI_ERR_OUT_OF_MEMORY);

	stack = GET_CURRENT_INTERNAL_FRAME( frame_builder )->gp_context_stack;
	MALI_DEBUG_ASSERT_HANDLE( stack );

#if HARDWARE_ISSUE_4175
	/**
	 * Dummy commands are required since the heap start address that we read
	 * in the first 'proper' command is not guaranteed to be updated unless the
	 * PLBU pipeline is flushed.
	 *
	 * In other words: we need to waste min. 5 cycles here.
	 *
	 * Set RSW/Vertex Base Address commands will not have any effect on output.
	 * (they only have effect when a vertex is processed - and we are done with
	 * vertex processing at this point.

	 * Each Set Base Address command will take 1 cycle per tile, so we need to
	 * add 5 commands when rendering to a single tile. If the number of tiles is >= 5,
	 * we just need a single command.
	 */
	cmds[ cmd_index++ ] = GP_PLBU_COMMAND_RSW_VERTEX_ADDR( 0, 0 );
	if ( GET_CURRENT_INTERNAL_FRAME( frame_builder )->tilelists->tile_pointers_to_load < 5 )
	{
		cmds[ cmd_index++ ] = GP_PLBU_COMMAND_RSW_VERTEX_ADDR( 0, 0 );
		cmds[ cmd_index++ ] = GP_PLBU_COMMAND_RSW_VERTEX_ADDR( 0, 0 );
		cmds[ cmd_index++ ] = GP_PLBU_COMMAND_RSW_VERTEX_ADDR( 0, 0 );
		cmds[ cmd_index++ ] = GP_PLBU_COMMAND_RSW_VERTEX_ADDR( 0, 0 );
	}
#endif /* HARDWARE_ISSUE_4175 */

	/* store current heap start - end addresses */
	cmds[ cmd_index++ ] = GP_PLBU_COMMAND_STORE_CONF_REG( _mali_mem_mali_addr_get( stack, (0*4)), GP_PLBU_CONF_REG_HEAP_START_ADDR );
	cmds[ cmd_index++ ] = GP_PLBU_COMMAND_STORE_CONF_REG( _mali_mem_mali_addr_get( stack, (1*4)), GP_PLBU_CONF_REG_HEAP_END_ADDR );

	/* store the viewportbox settings */
	cmds[ cmd_index++ ] = GP_PLBU_COMMAND_STORE_CONF_REG( _mali_mem_mali_addr_get( stack, (2*4)), GP_PLBU_CONF_REG_SCISSOR_LEFT );
	cmds[ cmd_index++ ] = GP_PLBU_COMMAND_STORE_CONF_REG( _mali_mem_mali_addr_get( stack, (3*4)), GP_PLBU_CONF_REG_SCISSOR_RIGHT );
	cmds[ cmd_index++ ] = GP_PLBU_COMMAND_STORE_CONF_REG( _mali_mem_mali_addr_get( stack, (4*4)), GP_PLBU_CONF_REG_SCISSOR_TOP );
	cmds[ cmd_index++ ] = GP_PLBU_COMMAND_STORE_CONF_REG( _mali_mem_mali_addr_get( stack, (5*4)), GP_PLBU_CONF_REG_SCISSOR_BOTTOM );
#if HARDWARE_ISSUE_7320
	{
		int i;
		for(i = 0; i < HARDWARE_ISSUE_7320_OUTSTANDING_WRITES; i++)
		{
			cmds[ cmd_index++ ] = GP_PLBU_COMMAND_STORE_CONF_REG( _mali_mem_mali_addr_get( stack, (5*4)), GP_PLBU_CONF_REG_SCISSOR_BOTTOM );
		}
	}
#endif

	/* and flush the pointer array */
	cmds[ cmd_index++ ] = GP_PLBU_COMMAND_FLUSH_POINTER_CACHE();
#if HARDWARE_ISSUE_7320
	{
		/* there are 21 writes per FLUSH_POINTER_CACHE. */
		int i;
		for(i = 0; i < ((HARDWARE_ISSUE_7320_OUTSTANDING_WRITES + 20) / 21); i++)
		{
			cmds[ cmd_index++ ] = GP_PLBU_COMMAND_FLUSH_POINTER_CACHE();
		}
	}
#endif
	/* currently the minimum number of cmds is 7 */
	MALI_DEBUG_ASSERT_RANGE( cmd_index, 7, MAX_NUM_CMDS );

	/* Commit the commands to the PLBU list */
	_mali_gp_job_plbu_cmds_confirm(gp_job, cmd_index );

#undef MAX_NUM_CMDS

	return MALI_ERR_NO_ERROR;
}

/**
 * Retrieve the necessary PLBU state data stored by _context_switch_out() so that the current gp_job
 * can continue working where a previous job left off.
 * Called once for each "incremental render", i.e. when M200 is set up to render the tile lists that
 * have been produced so far, before we continue building on the same lists.
 */
MALI_STATIC mali_err_code _gp_job_context_switch_in( mali_frame_builder *frame_builder, mali_gp_job_handle gp_job )
{
	mali_mem_handle      stack;
	mali_gp_plbu_cmd*     cmds;

	/* Init of viewportbox[] to stop an incorrect warning from Coverity as it doesn't handle unions correctly */
	union {
		float f;
		u32   i;
	} viewportbox[4] = { {0}, {0}, {0}, {0}};

