NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	MALI_DEBUG_ASSERT_HANDLE( gp_job );

	cmds = _mali_gp_job_plbu_cmds_reserve( gp_job, 16 );

    MALI_CHECK_NON_NULL(cmds, MALI_ERR_OUT_OF_MEMORY);

	stack = frame->gp_context_stack;
	MALI_DEBUG_ASSERT_HANDLE( stack );

	/* the tile list scale must be set before any tile list commands are generated */
	cmds[ 0 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( MALI_TILELIST_CHUNK_FORMAT << 8, GP_PLBU_CONF_REG_PARAMS);

	/* tile binning downscale */
	{
		MALI_DEBUG_ASSERT_POINTER(frame->tilelists);
#if defined(USING_MALI200)
		cmds[ 1 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( GP_PLBU_CONF_REGS_TILE_SIZE(frame->tilelists->binning_scale_x, frame->tilelists->binning_scale_y), GP_PLBU_CONF_REG_TILE_SIZE);
#else
		cmds[ 1 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( GP_PLBU_CONF_REGS_TILE_SIZE_WITH_FORMAT(frame->tilelists->binning_scale_x, frame->tilelists->binning_scale_y, frame->tilelists->polygonlist_format), GP_PLBU_CONF_REG_TILE_SIZE);
#endif
	}

	/* starting from r0p2 the screen size is set using master tile dimensions */
	cmds[ 2 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( 0 | ( (frame->tilelists->master_tile_height - 1) << 8 ) | ( 0 << 16 ) |
	                                            ( (frame->tilelists->master_tile_width - 1) << 24 ), GP_PLBU_CONF_REG_VIEWPORT );

	/* width for tile iterator */
	cmds[ 3 ] = GP_PLBU_COMMAND_PREPARE_FRAME( frame->tilelists->slave_tile_width );

	/* load the pointer array into the PLBU */
	cmds[ 4 ] = GP_PLBU_COMMAND_POINTER_ARRAY_BASE_ADDR_TILE_COUNT( _mali_mem_mali_addr_get( frame->tilelists->pointer_array_mem, 0 ), frame->tilelists->tile_pointers_to_load );

	/* load current heap start - end addresses */
	cmds[ 5 ] = GP_PLBU_COMMAND_LOAD_CONF_REG( _mali_mem_mali_addr_get( stack, (0*4)), GP_PLBU_CONF_REG_HEAP_START_ADDR );
	cmds[ 6 ] = GP_PLBU_COMMAND_LOAD_CONF_REG( _mali_mem_mali_addr_get( stack, (1*4)), GP_PLBU_CONF_REG_HEAP_END_ADDR );

	/* Setting initial viewportbox
	 * Using unions since the binary representation of the floats have to be written to the PLBUs config registers
	 */
	viewportbox[ 0 ].f = 0.f;
	viewportbox[ 1 ].f = frame_builder->vpbox.right;
	viewportbox[ 2 ].f = 0.f;
	viewportbox[ 3 ].f = frame_builder->vpbox.bottom;

	cmds[ 7 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[0].i, GP_PLBU_CONF_REG_SCISSOR_LEFT );
	cmds[ 8 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[1].i, GP_PLBU_CONF_REG_SCISSOR_RIGHT );
	cmds[ 9 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[2].i, GP_PLBU_CONF_REG_SCISSOR_TOP );
	cmds[ 10 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[3].i, GP_PLBU_CONF_REG_SCISSOR_BOTTOM );

	/* load the contexts viewportbox settings */
	cmds[ 11 ] = GP_PLBU_COMMAND_LOAD_CONF_REG( _mali_mem_mali_addr_get( stack, (2*4)), GP_PLBU_CONF_REG_SCISSOR_LEFT );
	cmds[ 12 ] = GP_PLBU_COMMAND_LOAD_CONF_REG( _mali_mem_mali_addr_get( stack, (3*4)), GP_PLBU_CONF_REG_SCISSOR_RIGHT );
	cmds[ 13 ] = GP_PLBU_COMMAND_LOAD_CONF_REG( _mali_mem_mali_addr_get( stack, (4*4)), GP_PLBU_CONF_REG_SCISSOR_TOP );
	cmds[ 14 ] = GP_PLBU_COMMAND_LOAD_CONF_REG( _mali_mem_mali_addr_get( stack, (5*4)), GP_PLBU_CONF_REG_SCISSOR_BOTTOM );
	/* and the scissorbox */
	cmds[ 15 ] = GP_PLBU_COMMAND_SET_SCISSOR( frame_builder->scissor.top,
	                                          frame_builder->scissor.bottom,
	                                          frame_builder->scissor.left,
	                                          frame_builder->scissor.right );

	/* Commit the commands to the PLBU list */
	_mali_gp_job_plbu_cmds_confirm( gp_job, 16 );

	return MALI_ERR_NO_ERROR;
}
/**
 * Finalize the current tile lists for incremental rendering. I.e. finalize them so that they
 * can processed by Mali200 before being appended with further primitives from GP2.
 * (Think; draw -> readpixels -> draw -> swapbuffers)
 */
MALI_STATIC mali_err_code _finalize_gp_job_with_context_switch( mali_frame_builder *frame_builder, mali_gp_job_handle *next_gp_job_ptr )
{
	mali_gp_job_handle   prev_gp_job;
	mali_gp_job_handle   next_gp_job;
	mali_err_code        error;

	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	MALI_DEBUG_ASSERT_POINTER( next_gp_job_ptr );
	prev_gp_job = frame->gp_job;

	*next_gp_job_ptr = MALI_NO_HANDLE;

	next_gp_job = _mali_gp_job_new( frame_builder->base_ctx );
	if( MALI_NO_HANDLE == next_gp_job ) return MALI_ERR_OUT_OF_MEMORY;

	_mali_gp_job_set_frame_id( next_gp_job, frame->frame_id );
	if( NULL != frame->plbu_heap_held && MALI_NO_HANDLE != frame->plbu_heap_held->plbu_heap ) _mali_gp_job_set_tile_heap( next_gp_job, frame->plbu_heap_held->plbu_heap );

	error = _gp_job_context_switch_in( frame_builder, next_gp_job );
	if( MALI_ERR_NO_ERROR != error )
	{
		_mali_gp_job_free( next_gp_job );
		return error;
	}

	error = _gp_job_context_switch_out( frame_builder, prev_gp_job );
	if( MALI_ERR_NO_ERROR == error )
	{
#if HARDWARE_ISSUE_3396
		MALI_DEBUG_ASSERT_POINTER(frame->tilelists);
		/* prior to r0p2 the "viewport" is set using slave tile dimensions */
		error = _mali_gp_job_add_plbu_cmd(prev_gp_job, GP_PLBU_COMMAND_WRITE_CONF_REG( 0 | ( (frame->tilelists->slave_tile_height - 1) << 8 ) | ( 0 << 16 ) |
											( (frame->tilelists->slave_tile_width - 1) << 24 ), GP_PLBU_CONF_REG_VIEWPORT ) );
		if( MALI_ERR_NO_ERROR != error )
		{
			_mali_gp_job_free( next_gp_job );
			return error;
		}
#endif
		error = _mali_gp_job_add_plbu_cmd( prev_gp_job, GP_PLBU_COMMAND_END_FRAME());
	}
	if( MALI_ERR_NO_ERROR != error )
	{
		_mali_gp_job_free( next_gp_job );
		return error;
	}

	*next_gp_job_ptr = next_gp_job;
	return MALI_ERR_NO_ERROR;
}


#if MALI_INSTRUMENTED
MALI_STATIC void _instrumented_pp_job_callback(void * cb_param, mali_pp_job_handle pp_job)
{
	mali_instrumented_frame *instrumented_frame = (mali_instrumented_frame *)cb_param;

	if ( NULL != instrumented_frame && _instrumented_is_sampling_enabled(_instrumented_get_context() ) )
	{
		/* let the instrumented module pull out performance counters from the pp job */
		_instrumented_pp_done( instrumented_frame, pp_job );
	}
	
