NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
}
#endif

/* It is only allowed to call this when the frame depencency is activated, but no pp jobs started. */
MALI_STATIC void _abort_pp_processing( mali_internal_frame *frame )
{
#if MALI_EXTERNAL_SYNC
	_mali_frame_call_pp_job_start_callback(frame, MALI_FALSE, MALI_FENCE_INVALID_HANDLE);
#endif /* MALI_EXTERNAL_SYNC */

	if ( NULL != frame->cb_func_complete_output )
	{
		(frame->cb_func_complete_output)(frame->cb_param_complete_output);
		frame->cb_func_complete_output = NULL; /* reset the callback after calling it once */
	}

	if ( NULL != frame->pp_job )
	{
#if MALI_INSTRUMENTED
		_instrumented_pp_abort(frame->pp_job);
#endif
		_mali_pp_job_free(frame->pp_job);
	}

	_mali_frame_builder_set_consumer_errors_with_force_release_pp( frame );

}

/* Callback function for the GP job that finalizes the tile lists. */
MALI_STATIC mali_bool _flush_geometry_callback( mali_base_ctx_handle base_ctx, void * cb_param, u32 job_stat, mali_gp_job_handle job_handle )
{
	mali_internal_frame *frame;

	MALI_DEBUG_ASSERT_HANDLE( base_ctx );
	MALI_DEBUG_ASSERT_POINTER( cb_param );

	frame = MALI_REINTERPRET_CAST(mali_internal_frame *) ( cb_param );

	MALI_DEBUG_ASSERT_POINTER(frame);

	/* record plbu_heap usage */
	if( NULL != frame->plbu_heap_held &&
		MALI_NO_HANDLE != frame->plbu_heap_held->plbu_heap)
	{
		MALI_DEBUG_ASSERT_POINTER(frame->frame_builder);
		frame->frame_builder->past_plbu_size[frame->frame_builder->current_period++ % 4] = _mali_mem_heap_used_bytes_get( frame->plbu_heap_held->plbu_heap ); 
		frame->plbu_heap_held->use_count++;
	}


#if MALI_INSTRUMENTED
	if (NULL != frame->instrumented_frame && _instrumented_is_sampling_enabled( _instrumented_get_context() ) )
	{
		/* let the instrumented module pull out performance counters from the gp job */
		_instrumented_gp_done( frame->instrumented_frame, job_handle );
	}
#else
	MALI_IGNORE(job_handle);
#endif

	if ( MALI_JOB_STATUS_END_SUCCESS == job_stat )
	{
		MALI_DEBUG_PRINT(3, ("GPE[%d]", frame->order_synch.swap_nr));

		MALI_DEBUG_ASSERT( NULL != frame->pp_job, ("Illegal state"));

		/* This removes the reference count held by the GP job.
			The Dependency System will call the PP jobs start function inside this function
		   if all dependencies are already met. If not it will start them when the
		   dependencies are met. */
#if MALI_INSTRUMENTED
		_instrumented_set_active_frame(frame->instrumented_frame);
#endif
		mali_ds_consumer_activation_ref_count_change(frame->ds_consumer_pp_render, MALI_DS_REF_COUNT_RELEASE);
#if MALI_INSTRUMENTED
		_instrumented_set_active_frame(NULL); /* Don't leave a dangling pointer */
#endif
	}
	else
	{
		if ( MALI_JOB_STATUS_END_OOM == job_stat )
		{
			MALI_INSTRUMENTED_LOG( (_instrumented_get_context(), MALI_LOG_LEVEL_ERROR,
			                   "Vertex processing: Out of tile list memory and was not able to recover - Aborting rendering") );
		}

#ifdef DEBUG
		{
			MALI_DEBUG_PRINT(0, ("%s() : Abnormal Mali GP job completion : ", MALI_FUNCTION));
			_debug_print_mali_jobstat( job_stat );
		}
#endif /* DEBUG */

		/* Update frame completion/error status */
		_mali_sys_atomic_set(&(frame->completion_status), job_stat);


		/* This will set an error state for the frame - And trigger the activation callback
		   The activation callback will call the release function which again will release the PP job
		   and do swap on the frame.*/
		_mali_frame_builder_set_consumer_errors_with_activate_pp( frame );
	}

	return MALI_TRUE;
}

void _mali_frame_builder_frame_dependency_activated(mali_base_ctx_handle base_ctx, void * owner, mali_ds_error status)
{
	mali_internal_frame *frame;

	MALI_IGNORE(base_ctx);

	frame = MALI_REINTERPRET_CAST(mali_internal_frame *) ( owner );
	MALI_DEBUG_PRINT(3, ("PPS[%d]", frame->order_synch.swap_nr));

	switch (status)
	{
		case MALI_DS_OK:
			if(_mali_projob_have_drawcalls(frame))
			{
				/* Start all projobs */
				_mali_projob_pp_flush(frame);

				/* Insert a barrier on the main job job so we can submit it right away */
				MALI_DEBUG_ASSERT( NULL != frame->pp_job, ("ERROR"));
				_mali_pp_job_set_barrier(frame->pp_job);

				_start_pp_processing_callback(frame);
			} else {
				/* no projobs, start PP job directly (without barrier) */
				_start_pp_processing_callback(frame);
			}
			break;
		case MALI_DS_ERROR:
			/* Fall through */
		default:
			_abort_pp_processing( frame );
	}
}


mali_ds_release _mali_frame_builder_frame_dependency_release(mali_base_ctx_handle base_ctx, void * owner, mali_ds_error status)
{
	mali_internal_frame *frame;

	frame = MALI_REINTERPRET_CAST(mali_internal_frame *) ( owner );

	return _flush_fragment_callback(base_ctx, frame, status);
}


MALI_STATIC void _pp_callback(mali_base_ctx_handle ctx, void * cb_param, mali_job_completion_status completion_status, mali_pp_job_handle job_handle)
{
	mali_internal_frame *frame;

	MALI_IGNORE(ctx);
	MALI_IGNORE(job_handle);

	frame = MALI_STATIC_CAST(mali_internal_frame *)cb_param;

	if ( NULL != frame->cb_func_complete_output )
	{
		(frame->cb_func_complete_output)(frame->cb_param_complete_output);
		frame->cb_func_complete_output = NULL; /* reset the callback after calling it once */
	}

#if MALI_PERFORMANCE_KIT
	if (mali_simple_hw_perf == -1)
	{
		mali_simple_hw_perf = (int)_mali_sys_config_string_get_s64("MALI_SIMPLE_HW_PERF", 0, 0, 1);
	}
	if (mali_custom_hw_perf == -1)
	{
		mali_custom_hw_perf = (int)_mali_sys_config_string_get_s64("MALI_CUSTOM_HW_PERF", 0, 0, 1);
		if(mali_custom_hw_perf == 1)
		{
			mali_print_custom_hw_perf = (int)_mali_sys_config_string_get_s64("MALI_PRINT_CUSTOM_HW_PERF", 0, 0, 1);
		}
		else
		{
			mali_print_custom_hw_perf = 0;
		}
	}

	if (mali_simple_hw_perf == 1 || mali_print_custom_hw_perf == 1)
	{
		_mali_sys_printf("Internal frame %u\n", frame);
	}
#endif

#if MALI_INSTRUMENTED
	_instrumented_pp_job_callback(frame->instrumented_frame, job_handle);
#endif

	if ( MALI_JOB_STATUS_END_SUCCESS != completion_status)
	{
		mali_ds_consumer_set_error(frame->ds_consumer_pp_render);
		mali_ds_consumer_set_error( frame->ds_consumer_gp_job );
	}

