NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	MALI_DEBUG_PRINT(3, ("Internal frame %u, job render_time\n", frame));

	mali_ds_consumer_release_ref_count_dec( frame->ds_consumer_pp_render );
}

MALI_STATIC void _start_pp_processing_callback(mali_internal_frame *frame)
{
	mali_pp_job_handle pp_job;
	pp_job = frame->pp_job;
	MALI_DEBUG_ASSERT( NULL != pp_job, ("ERROR"));

	/* We are ready to run the PP job, now check for a pending deep CoW */
	if ( FRAME_COW_DEEP_COPY_PENDING == frame->cow_flavour )
	{
		_mali_mem_copy( frame->cow_desc.dest_mem_ref->mali_memory,frame->cow_desc.mem_offset,
		                frame->cow_desc.src_mem_ref->mali_memory ,frame->cow_desc.mem_offset,
						frame->cow_desc.data_size);

		_mali_shared_mem_ref_owner_deref(frame->cow_desc.src_mem_ref);
		frame->cow_flavour = FRAME_COW_REALLOC;
	}

	/* Set up a the ref_count variable - Doing this BEFORE we start the jobs which can finish quickly */
	mali_ds_consumer_release_ref_count_set_initial(frame->ds_consumer_pp_render, 1);

	/* call event GPU_WRITE on all write-tracked surfaces */
	/* call event GPU_READ on all read-tracked surfaces */
	_mali_surfacetracking_start_track(frame->surfacetracking);
	
	/* GP processing completed successfully, PP processing can be started */
	_mali_pp_job_set_callback(pp_job, _pp_callback, frame );
#if MALI_TIMELINE_PROFILING_ENABLED
	_mali_base_profiling_add_event(VR_PROFILING_EVENT_TYPE_SINGLE | VR_PROFILING_EVENT_CHANNEL_SOFTWARE | VR_PROFILING_EVENT_REASON_SINGLE_SW_PP_ENQUEUE, 0, 0, frame->frame_builder->identifier, frame->flush_id, 0);
#endif

#if MALI_EXTERNAL_SYNC
	{
		mali_fence_handle fence;

		_mali_pp_job_start(pp_job, MALI_JOB_PRI_NORMAL, &fence);
		_mali_frame_call_pp_job_start_callback(frame, MALI_FENCE_INVALID_HANDLE != fence, fence);

		if (MALI_FENCE_INVALID_HANDLE != fence) mali_fence_release(fence);
	}
#else
	_mali_pp_job_start(pp_job, MALI_JOB_PRI_NORMAL, NULL);
#endif /* MALI_EXTERNAL_SYNC */

	/* The pp job can be freed by pp_job_start(), or later by the postprocessing callback, so we
	 * should assume at this point that it is no longer valid. */
	frame->pp_job = MALI_NO_HANDLE;
}

/* Callback function from the PP job that renders the frame */
MALI_STATIC mali_ds_release _flush_fragment_callback(mali_base_ctx_handle base_ctx, mali_internal_frame *frame, mali_ds_error status)
{
	mali_ds_consumer_handle next_frame_consumer = MALI_NO_HANDLE;
	mali_bool reset_on_finish;
	mali_job_completion_status completion_status;
	mali_bool exit_with_unlock = MALI_TRUE;

	MALI_DEBUG_ASSERT_HANDLE( base_ctx );

	_mali_sys_mutex_lock(frame->order_synch.frame_order_mutex);
	MALI_DEBUG_PRINT(3, ("PPE[%d]", frame->order_synch.swap_nr));

	frame->order_synch.in_flight = MALI_FALSE;
	next_frame_consumer = frame->order_synch.release_on_finish;
	frame->order_synch.release_on_finish = NULL;

	_mali_sys_mutex_unlock(frame->order_synch.frame_order_mutex);

	if ( MALI_DS_OK != status )
	{
		completion_status = MALI_JOB_STATUS_END_OOM;
		_mali_sys_atomic_set(&(frame->completion_status), completion_status );
	}
	else
	{
		completion_status = MALI_JOB_STATUS_END_SUCCESS;
	}

	if( MALI_NO_HANDLE != next_frame_consumer )
	{
		/* Releasing one reference to the next frame activation count.
		The next frame is now allowed to start (when its GP jobs is also finished). */
#if MALI_INSTRUMENTED
		_instrumented_set_active_frame(frame->instrumented_frame);
#endif
		mali_ds_consumer_activation_ref_count_change(next_frame_consumer, MALI_DS_REF_COUNT_RELEASE);
#if MALI_INSTRUMENTED
		_instrumented_set_active_frame(NULL); /* Don't leave a dangling pointer */
#endif
	}

	/* take the mutex as we'll modify the frame state */
	_mali_sys_mutex_lock( frame->mutex );

	reset_on_finish = frame->reset_on_finish;

#if MALI_SW_COUNTERS_ENABLED
	/* Dump the counters only if one or more of them is enabled. */
	if(reset_on_finish && (0 != _mali_base_get_setting(MALI_SETTING_SW_COUNTER_ENABLED)))
	{
		_mali_sw_counters_dump( frame->sw_counters );
	}
#endif

	/* do the heap_reset and the release of the plbu dependantcy before the frame reset as the reset can take some time */
#if !defined(HARDWARE_ISSUE_3251)
	/* reset PLBU heap */
	if( reset_on_finish  || MALI_JOB_STATUS_END_OOM == completion_status)
	{
		frame->plbu_heap_held = NULL;
	}
#endif

	frame->current_plbu_ds_resource = MALI_NO_HANDLE;

	/* rendering has ended (in one way or the other) so the frame state is complete */
	frame->state = FRAME_COMPLETE;

	_mali_sys_mutex_unlock( frame->mutex );

	mali_ds_consumer_release_all_connections(frame->ds_consumer_gp_job);

	/* call the GPU_READ_DONE callback on all read-tracked surfaces, if any */
	/* call the GPU_WRITE_DONE callback on all write-tracked surfaces, if any */
	_mali_surfacetracking_stop_track(frame->surfacetracking);

	/* and remove the write-surfacetracked surfaces as they are never written to again! */
	_mali_surfacetracking_reset(frame->surfacetracking, MALI_SURFACE_TRACKING_WRITE);

	/* the frame wont be used for any incremental rendering (it's most probably flush by a buffer swap),
	 * so it is reset after rendering has finished */
	if( reset_on_finish || MALI_JOB_STATUS_END_OOM == completion_status )
	{
#if MALI_USE_DEFERRED_FRAME_RESET
		_mali_frame_builder_frame_execute_callbacks_non_deferred( frame );
		/* remove all dependencies on this frame */
		mali_ds_consumer_release_set_mode(frame->ds_consumer_pp_render, MALI_DS_RELEASE_ALL);
		mali_ds_consumer_release_all_connections(frame->ds_consumer_pp_render);
		exit_with_unlock = MALI_FALSE;
		_mali_queue_frame_reset(frame);
#else
		_mali_frame_reset(frame);
#endif /* MALI_USE_DEFERRED_FRAME_RESET */
	}

#if MALI_INSTRUMENTED
	if (NULL != frame->instrumented_frame)
	{
		/* Release the reference we acquired in _internal_flush() */
		_instrumented_release_frame(frame->instrumented_frame);
		frame->instrumented_frame = NULL;
	}
#endif

	if (exit_with_unlock) _mali_sys_lock_unlock(frame->lock);

	return MALI_DS_RELEASE;
}

/* Rotate the swap chains for all attachments one step */
MALI_STATIC void _rotate_swap_chain( mali_frame_builder *frame_builder )

{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

