NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	/* rotate the frame chain */
	frame_builder->iframe_current = ROTATE_INTERNAL_FRAMES(frame_builder);
	frame_builder->swap_performed++;

}

MALI_STATIC mali_err_code _pp_jobs_create( mali_frame_builder     *frame_builder,
                                           mali_internal_frame    *frame,
                                           mali_base_ctx_handle    base_ctx )
{
	u32 i, num_cores;
	mali_pp_job_handle pp_job;
	mali_stream_handle stream;

	MALI_DEBUG_ASSERT_HANDLE(  base_ctx );
	MALI_DEBUG_ASSERT_POINTER( frame );
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

#if defined(USING_MALI450)
	/* Use zero cores for Mali-450, indicating that we should use the DLBU. */
	num_cores = 0;
#else
	num_cores = frame->curr_pp_split_count;
#endif /* defined(USING_MALI450) */

#if MALI_EXTERNAL_SYNC
	stream = frame->stream;
#else
	stream = NULL;
#endif /* MALI_EXTERNAL_SYNC */

	pp_job = _mali_pp_job_new(base_ctx, num_cores, stream);

	if (MALI_NO_HANDLE == pp_job)
	{
		MALI_ERROR(MALI_ERR_OUT_OF_MEMORY);
	}
	else
	{
		_pp_job_setup_common_registers(frame_builder, frame, pp_job);
		_mali_pp_job_set_frame_id( pp_job, frame->frame_id );

		for (i = 0; i < frame->curr_pp_split_count; ++i)
		{
			_pp_job_setup_specific_registers(frame, pp_job, i);
		}

		if ( frame_builder->egl_funcptrs && frame_builder->egl_funcptrs->get_synchandle )
		{
			mali_sync_handle local = frame_builder->egl_funcptrs->get_synchandle();
			_mali_pp_job_add_to_sync_handle( local, pp_job);
		}

#if MALI_INSTRUMENTED
		{
			int j;

			for ( j = 0; j < MALI200_WRITEBACK_UNIT_COUNT; j++ )
			{
				struct mali_surface *render_target = frame_builder->output_buffers[j].buffer;

				if ( NULL != render_target)
				{
					_mali_base_common_instrumented_pp_job_set_wbx_mem(pp_job, j, render_target->mem_ref->mali_memory);
				} else {
					_mali_base_common_instrumented_pp_job_set_wbx_mem(pp_job, j, MALI_NO_HANDLE);
				}
			}
		}
#endif
	}

#if defined(USING_MALI450)
	/* Setting the info needed for the Dynamic Load Balancing unit */
	{
		m450_pp_job_frame_info info;
		info.slave_tile_list_mali_address = _mali_mem_mali_addr_get(frame->tilelists->slave_tile_list_mem, 0);
		MALI_DEBUG_ASSERT( 0!= info.slave_tile_list_mali_address, ("ERROR: slave tile list has Null address! \n")) ;
		info.master_x_tiles = frame->tilelists->master_tile_width;
		info.master_y_tiles = frame->tilelists->master_tile_height;
		info.size = M400_TILE_BLOCK_SIZE_128 + MALI_TILELIST_CHUNK_FORMAT;
		info.binning_pow2_x = frame->tilelists->binning_scale_x;
		info.binning_pow2_y = frame->tilelists->binning_scale_y;
		/* HACK: Hardcoding that we have 8 PP cores for M450 */
		if ( frame->fs_stack.fs_stack_mem )
		{
			info.stack_size_per_core = (_mali_mem_size_get( frame->fs_stack.fs_stack_mem ))/8;
		}
		else
		{
			info.stack_size_per_core = 0;
		}

		_mali_pp_job_450_set_frame_info(pp_job, &info);
	}
#endif /* defined(USING_MALI450) */

	frame->pp_job = pp_job;

	MALI_SUCCESS;
}

/**
 * The internals of the _flush() and _swap() frame_builder interface entrypoints
 */
MALI_STATIC mali_err_code _internal_flush( mali_frame_builder *frame_builder,
                                           mali_bool frame_swap )

{
	mali_base_ctx_handle base_ctx = _mali_frame_builder_get_base_ctx(frame_builder);
	mali_err_code error;
	mali_gp_job_handle   next_gp_job = MALI_NO_HANDLE, current_gp_job;
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	MALI_DEBUG_PRINT(3, ("F[%d]", frame->order_synch.swap_nr));
	MALI_DEBUG_ASSERT_POINTER(frame_builder);
	MALI_DEBUG_ASSERT_POINTER(frame);

	/* early out if the FBO is set up wrong */
	if(frame_builder->output_valid == MALI_FALSE)
	{
		if(frame->state == FRAME_RENDERING)
		{
			_mali_frame_wait( frame );
		}

		if(frame->state != FRAME_UNMODIFIED)
		{
			_mali_frame_reset( frame );
		}

		return MALI_ERR_NO_ERROR;
	}

	_mali_sys_mutex_lock(frame->mutex);

	/* If the frame is clean it might've been "fully cleared" (reset), so we must ensure
	 * we can render the framebuffer with the clearcolor */
	if( frame->state == FRAME_CLEAN )
	{
		error = _frame_builder_use_internal( frame_builder, frame );
		if( MALI_ERR_NO_ERROR != error )
		{
			_mali_sys_mutex_unlock(frame->mutex);
			return error;
		}
	}

	/* if there's nothing (new) to render we can just execute the callbacks */
	if( frame->state == FRAME_COMPLETE || frame->state == FRAME_UNMODIFIED )
	{
		/* if the frame has been flushed but should be swapped, we must reset it here */
		_mali_sys_mutex_unlock(frame->mutex);

		/* Wait for the frame to really be COMPLETE before resetting it */
#if MALI_TIMELINE_PROFILING_ENABLED
		_mali_base_profiling_add_event(VR_PROFILING_EVENT_TYPE_SUSPEND|VR_PROFILING_EVENT_CHANNEL_SOFTWARE|VR_PROFILING_EVENT_REASON_SUSPEND_RESUME_SW_FB_IFRAME_SYNC, 0, 0, frame->frame_builder->identifier, (u32)frame, 0);
#endif
		_mali_sys_lock_lock(frame->lock);
		_mali_sys_lock_unlock(frame->lock);
#if MALI_TIMELINE_PROFILING_ENABLED
		_mali_base_profiling_add_event(VR_PROFILING_EVENT_TYPE_RESUME|VR_PROFILING_EVENT_CHANNEL_SOFTWARE|VR_PROFILING_EVENT_REASON_SUSPEND_RESUME_SW_FB_IFRAME_SYNC, 0, 0, frame->frame_builder->identifier, (u32)frame, 0);
#endif
		if( MALI_TRUE == frame_swap && frame->state == FRAME_COMPLETE ) 
		{
			_mali_frame_reset( frame );
		}

		return MALI_ERR_EARLY_OUT;
	}
	else if( frame->state == FRAME_RENDERING )
	{
		/* If the frame is currently rendering we don't need to perform any changes on it,
		 * however, if the currently rendering frame has an existing callback different from the
		 * one we want to set, we must make sure both are called.
		 */
		if(frame_swap) frame->reset_on_finish = MALI_TRUE;
		_mali_sys_mutex_unlock(frame->mutex);
		return MALI_ERR_NO_ERROR;
	}

	MALI_DEBUG_ASSERT( MALI_FALSE != frame_builder->output_valid, ("Invalid output in flush. Clean frame called _internal_use and became invalid") );

	/* the init should be done only once per frame in case we are in incremental rendering */
	if( 0 == frame->num_flushes_since_reset )
	{
		error = _mali_frame_builder_init_per_frame(frame_builder);
		if( MALI_ERR_NO_ERROR != error )
		{
			_mali_sys_mutex_unlock(frame->mutex);
			return error;
		}
	}

	_mali_sys_mutex_unlock(frame->mutex);

