NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	/* we track the number of flushes since last reset as a heuristic for incremental rendering
	 * (tracked after the early-outs on purpose)
	 */
	frame->num_flushes_since_reset++;

	/* make sure the pool is unmapped */
	if( frame->pool_mapped )
	{
		/* unmap the mem pool */
		_mali_mem_pool_unmap( &frame->frame_pool );
		frame->pool_mapped = MALI_FALSE;
	}

	/* setup the CoW behaviour before we might trigger it when making the DS_WRITE connect call */
	frame->cow_flavour = FRAME_COW_REALLOC;

	if ( frame_builder->output_buffers[MALI_DEFAULT_COLOR_WBIDX].usage & MALI_OUTPUT_WRITE_DIRTY_PIXELS_ONLY )
	{
		frame->cow_flavour = FRAME_COW_DEEP;
	}

	/* Makes a Dependency System connection between frame->ds_consumer_pp_render and
	each render target. This makes sure that the PP jobs are not started before all
	these WRITE dependencies are met. */
	error = _add_flush_dependencies_on_buffers(frame, frame_builder, frame_swap);

	if( MALI_ERR_NO_ERROR != error )
	{
		/* The dependency system will release connections and reset the consumer,
		but not call callbacks. Since the consumer is not flushed. */

		_mali_frame_builder_set_consumer_errors_with_force_release_pp( frame );
		_mali_frame_builder_reset( frame_builder );
		return error;
	}

	/* update fragment stack memory allocation in the frame */
	error = _fragment_stack_alloc( frame_builder );
	if( MALI_ERR_NO_ERROR != error )
	{
		/* The dependency system will release connections and reset the consumer,
		but not call callbacks. Since the consumer is not flushed. */
		_mali_frame_builder_set_consumer_errors_with_force_release_pp( frame );
		_mali_frame_builder_reset( frame_builder );
		return error;
	}

	/* Initialize the PP Job(s) */
	error = _pp_jobs_create(frame_builder, frame, base_ctx);
	if ( MALI_ERR_NO_ERROR != error )
	{
		/* The dependency system will release connections and reset the consumer,
		but not call callbacks. Since the consumer is not flushed. */
		_mali_frame_builder_set_consumer_errors_with_force_release_pp( frame );
		_mali_frame_builder_reset( frame_builder );
		return MALI_ERR_OUT_OF_MEMORY;
	}

#if MALI_EXTERNAL_SYNC

	if (MALI_FENCE_INVALID_HANDLE != frame_builder->output_fence)
	{
		mali_fence_handle fence;

		fence = mali_fence_dup(frame_builder->output_fence);

		MALI_DEBUG_ASSERT(MALI_FENCE_INVALID_HANDLE != fence, ("fence dup failed on pp_job_set_fence"));

		if (MALI_FENCE_INVALID_HANDLE == fence)
		{
			/* The dependency system will release connections and reset the consumer,
			   but not call callbacks. Since the consumer is not flushed. */
			_mali_frame_builder_set_consumer_errors_with_force_release_pp( frame );
			_mali_frame_builder_reset( frame_builder );
			return MALI_ERR_OUT_OF_MEMORY;
		}

		_mali_pp_job_set_fence(frame->pp_job, fence);
	}

	frame_builder->egl_funcptrs->_sync_notify_job_create(frame_builder);

	/* WARNING: after the sync_notify_job_create callback has been called, it is VERY IMPORTANT
	   that the job_start callbacks are called with MALI_FALSE for started, if anything fails
	   before mali_ds_consumer_flush(frame->ds_consumer_pp_render). */

#endif /* MALI_EXTERNAL_SYNC */

	MALI_DEBUG_ASSERT(frame->job_inited == 2, ("job Init state in flush should be 2 but is %d framestate %d numflushes %d \n", frame->job_inited, frame->state, frame->num_flushes_since_reset ) );

	/* set up the necessary list finalization and context switching to the new gp job */
	if( frame_swap == MALI_FALSE )
	{
		/* set up the necessary list finalization and context switching to the new gp job */
		error = _finalize_gp_job_with_context_switch( frame_builder, &next_gp_job );

		/* the job will be automatically released on completion */
		_mali_gp_job_set_auto_free_setting( frame->gp_job, MALI_TRUE );
	}
	else
	{
		/* no need for a new gp job as this frame will be reset on completion anyway */
#if HARDWARE_ISSUE_3396
		/* prior to r0p2 the "viewport" is set using slave tile dimensions */

		error = _mali_gp_job_add_plbu_cmd(frame->gp_job, GP_PLBU_COMMAND_WRITE_CONF_REG( 0 | ( (frame->tilelists->slave_tile_height - 1) << 8 ) | ( 0 << 16 ) |
											( (frame->tilelists->slave_tile_width - 1) << 24 ), GP_PLBU_CONF_REG_VIEWPORT ) );
		if( MALI_ERR_NO_ERROR != error )
		{
#if MALI_EXTERNAL_SYNC
			_mali_frame_call_pp_job_start_callback(frame, MALI_FALSE, MALI_FENCE_INVALID_HANDLE);
#endif /* MALI_EXTERNAL_SYNC */
			_mali_gp_job_free( next_gp_job );
			/* The dependency system will release connections and reset the consumer,
			but not call callbacks. Since the consumer is not flushed. */
			_mali_frame_builder_set_consumer_errors_with_force_release_pp( frame );
			_mali_frame_builder_reset( frame_builder );
			return error;
		}
#endif /* HARDWARE_ISSUE_3396 */
		error = _mali_gp_job_add_plbu_cmd( frame->gp_job, GP_PLBU_COMMAND_END_FRAME());

		/* the job will not be released on completion */
		_mali_gp_job_set_auto_free_setting( frame->gp_job, MALI_FALSE );
	}

	if( MALI_ERR_NO_ERROR != error )
	{
#if MALI_EXTERNAL_SYNC
		_mali_frame_call_pp_job_start_callback(frame, MALI_FALSE, MALI_FENCE_INVALID_HANDLE);
#endif /* MALI_EXTERNAL_SYNC */
		_mali_pp_job_free( frame->pp_job );
		frame->pp_job = MALI_NO_HANDLE;

		/* The dependency system will release connections and reset the consumer,
		but not call callbacks. Since the consumer is not flushed. */
		_mali_frame_builder_set_consumer_errors_with_force_release_pp( frame );
		_mali_frame_builder_reset( frame_builder );
		return error;
	}

#if MALI_INSTRUMENTED
	frame->instrumented_frame = _instrumented_acquire_current_frame();

	if (NULL != frame->instrumented_frame && _instrumented_is_sampling_enabled( _instrumented_get_context() ))
	{
		/* instrument the PP and GP jobs */
		/* Setup the pp job for instrumentation */
		_instrumented_pp_setup( _instrumented_get_context(), frame->pp_job, 0 );

		_instrumented_gp_setup( _instrumented_get_context(), frame->gp_job );
		_mali_instrumented_gp_set_plbu_stack_handle( frame->gp_job, frame->gp_context_stack );
	}
#endif /* MALI_INSTRUMENTED */

	MALI_DEBUG_ASSERT_POINTER(frame->tilelists);
	_mali_gp_job_set_plbu_pointer_array( frame->gp_job, frame->tilelists->pointer_array_mem );

	/*set the GP job callback which will trigger the dependency system to start the PP job */
	_mali_gp_job_set_callback( frame->gp_job, MALI_REINTERPRET_CAST(mali_cb_gp) _flush_geometry_callback, MALI_REINTERPRET_CAST(void *) frame );

	/* add memory to be free'd when the job is completed */
	if( frame->gp_job_mem_list != MALI_NO_HANDLE )
	{
		_mali_gp_job_add_mem_to_free_list( frame->gp_job, frame->gp_job_mem_list );
		frame->gp_job_mem_list = MALI_NO_HANDLE;
	}

#if MALI_TIMELINE_PROFILING_ENABLED
	/* set the GP job identity */
	{
		frame->flush_id = MAKE_FLUSH_ID(frame_builder->iframe_current, frame_swap, frame_builder->flush_count);
		_mali_gp_job_set_identity(frame->gp_job, frame_builder->identifier, frame->flush_id);

