NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
		/* set PP jobs identities */
		_mali_pp_job_set_identity(frame->pp_job, frame_builder->identifier, frame->flush_id);

		_mali_base_profiling_add_event(VR_PROFILING_EVENT_TYPE_SINGLE | VR_PROFILING_EVENT_CHANNEL_SOFTWARE | VR_PROFILING_EVENT_REASON_SINGLE_SW_FLUSH, 0, 0, frame_builder->identifier, frame->flush_id, 0);

		/* flush is considered successful from this point on (no returns with error), safe to increase
			the flush count. */
		frame_builder->flush_count++;
	}
#endif

	current_gp_job = frame->gp_job ;
	if( frame_swap == MALI_FALSE ) frame->gp_job = next_gp_job;

	_mali_sys_mutex_lock(frame->mutex);

	/* frame should be reset on completion if we're swapping buffers */
	frame->reset_on_finish = frame_swap;

	frame->state = FRAME_RENDERING;
	/* Setting in flight - means that it is in the rendering pipeline */
	frame->order_synch.in_flight = MALI_TRUE;

	_mali_sys_mutex_unlock(frame->mutex);

	/* mark the frame as in use by Mali */
	_mali_sys_lock_lock( frame->lock );

	/* Add an additional ref count for the GP job, so that we can flush the consumer now */
	mali_ds_consumer_activation_ref_count_change(frame->ds_consumer_pp_render,1);

	/* Flushing consumer; PP job will start when all the surfaces it depends on are
	   available AND the ref_count set above for the GP job is decreased */
	mali_ds_consumer_flush(frame->ds_consumer_pp_render);

	MALI_DEBUG_ASSERT_POINTER( frame->ds_consumer_gp_job );

	frame->current_gp_job = current_gp_job;

	/* If this frame has not been assigned a plbu-resource yet, then give it one and add dependency on it */
	if ( MALI_NO_HANDLE == frame->current_plbu_ds_resource && frame->plbu_heap_held != NULL && frame->plbu_heap_held->plbu_heap != NULL)
	{
		frame->current_plbu_ds_resource = frame_builder->plbu_heaps[ frame_builder->plbu_heap_current ].plbu_ds_resource;

		MALI_DEBUG_ASSERT_POINTER( frame->current_plbu_ds_resource );
		MALI_DEBUG_ASSERT( frame->plbu_heap_held == &frame_builder->plbu_heaps[ frame_builder->plbu_heap_current ], ("Out of sync between DS resource and associated heap") );

		/* Connect the plbu-heap with a resource to the gp-consumer, this connection will be released in
		 * the _flush_fragment_callback function */
		if ( MALI_ERR_NO_ERROR !=
		     mali_ds_connect( frame->ds_consumer_gp_job, frame->current_plbu_ds_resource, MALI_DS_WRITE ))
		{
			frame->current_plbu_ds_resource = MALI_NO_HANDLE;
			mali_ds_consumer_set_error(frame->ds_consumer_gp_job);
		}
	}

#if MALI_INSTRUMENTED
	_instrumented_set_active_frame(frame->instrumented_frame);
#endif

	/* execute the lock output callback if specified */
	if ( NULL != frame->cb_func_lock_output )
	{
		(frame->cb_func_lock_output)(frame->cb_param_lock_output);
	}

	mali_ds_consumer_flush( frame->ds_consumer_gp_job );

#if MALI_INSTRUMENTED
		_instrumented_set_active_frame(NULL); /* don't leave dangling pointers in TLS */
#endif

	return MALI_ERR_NO_ERROR;
}

MALI_STATIC void _mali_incremental_render_on_flush( mali_frame_builder *frame_builder )
{
	if ( frame_builder->inc_render_on_flush )
	{

		/* This flush is triggered by eglClientWaitSync for fence sync */
		mali_err_code err = MALI_ERR_NO_ERROR;
		_mali_frame_set_inc_render_on_flush( frame_builder, MALI_FALSE );

		 err = _mali_incremental_render( frame_builder );

		/* if err == MALI_ERR_EARLY_OUT this means that there is nothing to render, reset the fb for the callbacks to be called */
		if ( MALI_ERR_EARLY_OUT == err )
		{
			_mali_frame_builder_reset( frame_builder );
		}
	}
}

MALI_STATIC mali_err_code _mali_frame_builder_flush_common( mali_frame_builder *frame_builder,
                                                            mali_bool swap_behaviour )
{
	mali_err_code error;

	MALI_DEBUG_ASSERT_POINTER( frame_builder );

#if MALI_SW_COUNTERS_ENABLED
	{
		mali_internal_frame *frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );
		mali_sw_counters *counters = frame->sw_counters;
		MALI_DEBUG_ASSERT_POINTER(counters);
		MALI_PROFILING_INCREMENT_COUNTER(counters, GLES, NUM_FLUSHES, 1);
	}
#endif /* MALI_SW_COUNTERS_ENABLED */

	if ( frame_builder->properties & MALI_FRAME_BUILDER_PROPS_ROTATE_ON_FLUSH ) swap_behaviour = MALI_TRUE;  /* if rotate on flush, all flushes act as swaps */

	/* consider incremental rendering only when not swapping. */
	if(swap_behaviour == MALI_FALSE) _mali_incremental_render_on_flush( frame_builder );

	error = _internal_flush( frame_builder, swap_behaviour );

	if(swap_behaviour)
	{
		if ( frame_builder->properties & MALI_FRAME_BUILDER_PROPS_UNDEFINED_AFTER_SWAP)
		{
			frame_builder->buffer_state_per_plane = MALI_COLOR_PLANE_UNDEFINED | MALI_DEPTH_PLANE_UNDEFINED | MALI_STENCIL_PLANE_UNDEFINED; 
		}
		else
		{
			if(!(frame_builder->buffer_state_per_plane & MALI_COLOR_PLANE_UNDEFINED)) 
			{
				frame_builder->buffer_state_per_plane &= ~MALI_COLOR_PLANE_MASK;
				frame_builder->buffer_state_per_plane |= MALI_COLOR_PLANE_UNCHANGED;
			}
			if(!(frame_builder->buffer_state_per_plane & MALI_DEPTH_PLANE_UNDEFINED)) 
			{
				frame_builder->buffer_state_per_plane &= ~MALI_DEPTH_PLANE_MASK;
				frame_builder->buffer_state_per_plane |= MALI_DEPTH_PLANE_UNCHANGED;
			}
			if(!(frame_builder->buffer_state_per_plane & MALI_STENCIL_PLANE_UNDEFINED)) 
			{
				frame_builder->buffer_state_per_plane &= ~MALI_STENCIL_PLANE_MASK;
				frame_builder->buffer_state_per_plane |= MALI_STENCIL_PLANE_UNCHANGED;
			}
		}

		frame_builder->preserve_multisample = MALI_FALSE;
	}

	/* if swapping, rotate the frame */
	if ( error == MALI_ERR_NO_ERROR && swap_behaviour != MALI_FALSE )	_rotate_swap_chain( frame_builder );

#ifndef NDEBUG
	if(error != MALI_ERR_NO_ERROR && error != MALI_ERR_EARLY_OUT)
	{
		mali_internal_frame *frame;
		frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

		_mali_sys_mutex_lock(frame->mutex);
		MALI_DEBUG_ASSERT(frame->state != FRAME_RENDERING, ("if flush failed, no rendering allowed"));
		MALI_DEBUG_ASSERT(frame->state != FRAME_COMPLETE, ("if flush failed, no complete allowed"));
		_mali_sys_mutex_unlock(frame->mutex);
	}
#endif

	if ( error == MALI_ERR_EARLY_OUT ) return MALI_ERR_NO_ERROR; /* don't return that early out */
	return error;
}

MALI_EXPORT mali_err_code _mali_frame_builder_flush( mali_frame_builder *frame_builder )
{
	return _mali_frame_builder_flush_common( frame_builder, MALI_FALSE );
}

MALI_EXPORT mali_err_code _mali_frame_builder_swap( mali_frame_builder *frame_builder )
{
	return _mali_frame_builder_flush_common( frame_builder, MALI_TRUE );
}

MALI_EXPORT mali_bool _mali_frame_builder_is_modified( mali_frame_builder *frame_builder )
{
	mali_internal_frame *frame;
	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	return frame->state == FRAME_UNMODIFIED ? MALI_FALSE : MALI_TRUE;
}

MALI_EXPORT void _mali_frame_builder_add_frame_mem( mali_frame_builder *frame_builder,
                                                    mali_mem_handle mem_handle )
{
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	MALI_DEBUG_ASSERT_HANDLE( mem_handle );

	_mali_frame_builder_add_internal_frame_mem( frame, mem_handle );

