NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
}

MALI_EXPORT void _mali_frame_builder_wait_frame( mali_frame_builder *frame_builder )
{
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	_mali_frame_wait( frame );

}

MALI_EXPORT void _mali_frame_builder_wait( mali_frame_builder *frame_builder )
{

	/* If the are rotating on calls to _mali_frame_builder_flush, we need to wait
	 * on previous frames as well since the current frame is no longer the one that
	 * was flushed.
	 */
	if ( frame_builder->properties & MALI_FRAME_BUILDER_PROPS_ROTATE_ON_FLUSH )
	{
		_mali_frame_builder_wait_all( frame_builder );
	}
	else
	{
		mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );
		_mali_frame_wait( frame );
	}

}

MALI_EXPORT void _mali_frame_builder_wait_all( mali_frame_builder *frame_builder )
{
	mali_internal_frame *frame_next;
	u32 i;
	u32 frame_idx;
	u32 swap_count;

	MALI_DEBUG_ASSERT_POINTER(frame_builder);

	frame_idx = frame_builder->iframe_current;
	swap_count = frame_builder->iframe_count;

	if( NULL != frame_builder->iframes )
	{
		for ( i = 0; i < swap_count; i++ )
		{
			frame_idx = (frame_idx + 1) == ( swap_count ) ? 0 : frame_idx + 1;
			frame_next = frame_builder->iframes[ frame_idx ];
			_mali_frame_wait( frame_next );
		}
	}
}

MALI_EXPORT void _mali_frame_builder_set_output( mali_frame_builder *frame_builder,
                                                  u32 wbx_id,
                                                  struct mali_surface *surface,
                                                  u32 usage )
{
	int i;

	/* output parameters */
	u32 output_width = 0;
	u32 output_height = 0;
	mali_bool output_valid = MALI_TRUE;
	u32 largest_xscale = 1;
	u32 largest_yscale = 1;

	/* bounding box parameters */
	int bb_width = 0;
	int bb_height = 0;
	mali_bool bb_used = MALI_FALSE;
	mali_bool bb_enable[MALI200_WRITEBACK_UNIT_COUNT]; /* per wbx */
	struct mali_frame_builder_output_chain *output;

	MALI_DEBUG_ASSERT_POINTER( frame_builder );


	MALI_DEBUG_ASSERT_RANGE( (int)wbx_id, 0, MALI200_WRITEBACK_UNIT_COUNT - 1);


	/* attach surfaces to the fbuilder, detach old surfaces */
	if ( NULL != surface )
	{
		_mali_surface_addref(surface);

		/* verify that the newly attached surface adhere to the WBx Target AA limitations */
		#ifndef NDEBUG

		/* FP16 formats do not support ANY downscaling */
		if( usage &
		 ( MALI_OUTPUT_DOWNSAMPLE_X_2X | MALI_OUTPUT_DOWNSAMPLE_X_4X | MALI_OUTPUT_DOWNSAMPLE_X_8X |
		   MALI_OUTPUT_DOWNSAMPLE_Y_2X | MALI_OUTPUT_DOWNSAMPLE_Y_4X | MALI_OUTPUT_DOWNSAMPLE_Y_8X |
		   MALI_OUTPUT_DOWNSAMPLE_Y_16X ))
		{
			MALI_DEBUG_ASSERT(surface->format.pixel_format != MALI_PIXEL_FORMAT_ARGB_FP16 &&
			                  surface->format.pixel_format != MALI_PIXEL_FORMAT_B_FP16 &&
			                  surface->format.pixel_format != MALI_PIXEL_FORMAT_GB_FP16,
							  ("FP16 output formats require: No downscaling bits set"));
		}

		/* 8 bit formats do not support 4x or 8x downscaling */
		if( usage &
		 ( MALI_OUTPUT_DOWNSAMPLE_X_4X | MALI_OUTPUT_DOWNSAMPLE_X_8X ))
		{
			MALI_DEBUG_ASSERT( surface->format.pixel_format != MALI_PIXEL_FORMAT_B8 &&
			                   surface->format.pixel_format != MALI_PIXEL_FORMAT_S8,
							 ("8bit formats require: No 4x or 8x downscaling in the x axis"));
		}

		/* 16 bit formats do not support 8x downscaling */
		if( usage & MALI_OUTPUT_DOWNSAMPLE_X_8X )
		{
			MALI_DEBUG_ASSERT( surface->format.pixel_format != MALI_PIXEL_FORMAT_R5G6B5 &&
			                   surface->format.pixel_format != MALI_PIXEL_FORMAT_A1R5G5B5 &&
			                   surface->format.pixel_format != MALI_PIXEL_FORMAT_A4R4G4B4 &&
			                   surface->format.pixel_format != MALI_PIXEL_FORMAT_G8B8 &&
			                   surface->format.pixel_format != MALI_PIXEL_FORMAT_Z16,
							 ("16 bit formats require: No 8x downscaling in the x axis"));
		}
		#endif

	}

	output = &frame_builder->output_buffers[wbx_id];
	if(output->buffer)
	{
		_mali_surface_deref(output->buffer);
	}

	output->buffer = surface;
	output->usage  = usage;

	frame_builder->fp16_format_used = MALI_FALSE;


	/**
	 * Bounding box headaches:
	 *
	 * Mali always output full tiles - the bounding box allows you to cull some of that tile output.
	 * This is vital for linear outputs where the output buffer has a width divisible by 8, failure to use
	 * the bounding box will lead the unused parts of a tile to bleed over to the next scanline.
	 *
	 * The bounding box is enabled/disabled per writeback unit, but can only have one value. This value is set as
	 * a frame register, specified once per job. If enabled, the pixels outside of the bbox boundaries are culled.
	 *
	 * If using supersampling, this scheme is complicated, as each WBx can have a different supersample scalefactor.
	 * The HW will automatically *multiply* the bounding box register value with the supersample scalefactor.
	 * The idea is that if the bbox is set to the output size (f.ex 640x480), then the bbox will be doubled up
	 * to 1280x960 or whatever on wbunits using supersampling automatically. This scheme works perfectly as
	 * long as the framebuilder dimensions are actually 1280x960 and the WBx is set up to render to a 640x480
	 * supersampled output.
	 *
	 * But it is not always this well-working. A simple texture mipgen render operation where we want the HW
	 * to generate three mipmap levels of a texture can really mess this up. Assume you want to make miplevels
	 * for a 256x256 texture.
	 *  - WB0 is set up to render a 128x128 miplevel (2x downscale)
	 *  - WB1 is set up to render a 64x64 miplevel   (4x downscale)
	 *  - WB2 is set up to render a 32x32 miplevel   (8x downscale)
	 *
	 * In this case, the bounding box simply cannot be used. If the bbox is set to 32x32 in this case, then
	 *  - WB0 will assume the bounding box is (32x32)*2 = 64x64 (4x too small!)
	 *  - WB1 will assume the bounding box is (32x32)*4 = 256x256 (perfect)
	 *  - WB2 will assume the bounding box is (32x32)*8 = 1024x1024 (4x too large!)
	 *
	 * Concluding - we cannot use the bounding box in this use-case, and when detecting the usecase we need to
	 * disable the bounding box. For each writeback unit using ...
	 *
	 *  - #1: Block-interleaved output:
	 *      Disable the bounding box.
	 *      It doesn't matter if we render to the full tiles. No one will read the extra pixels anyway.
	 *
	 *  - #2: Linear outputs that are framebuilder tile-aligned
	 *      Disable the bounding box.
	 *      It doesn't matter if the bounding box is enabled or not, no pixels should be culled anyway.
	 *
	 *  - #3: Non-tilealigned linear outputs, where the superscale factor is identical to the common ground bbox:
	 *      The bbox size is set to the dimensions of the frame divided by the supersample scalefactor
	 *      The bounding box is enabled unless hardware issues disallow it.
	 *      This should have no problems, and will cover the common case of one output buffer.
	 *
	 *  - #4: Non-tilealigned linear outputs, where the superscale factor is not identical to the common ground bbox:
	 *      Assert crash - treat the output setup as invalid.
	 *      The usecase is not possible to handle and should never be allowed to be set up.
	 *
	 * The solution is to set up a bounding box right here, and a bitmask telling whether it is used on each WBx unit.
	 *
	 */

	/* validate all outputs */
	for(i = 0; i < MALI200_WRITEBACK_UNIT_COUNT; i++)
	{
		u32 w, h;
		u32 xscale = 1;
		u32 yscale = 1;
		mali_surface* surf;
		u32 usage;

		bb_enable[i] = MALI_FALSE;

