NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
		surf = frame_builder->output_buffers[i].buffer;
		if(surf == NULL) continue;
		usage = frame_builder->output_buffers[i].usage;

		if(usage & MALI_OUTPUT_DOWNSAMPLE_X_2X) xscale = 2;
		if(usage & MALI_OUTPUT_DOWNSAMPLE_X_4X) xscale = 4;
		if(usage & MALI_OUTPUT_DOWNSAMPLE_X_8X) xscale = 8;
		if(usage & MALI_OUTPUT_DOWNSAMPLE_Y_2X) yscale = 2;
		if(usage & MALI_OUTPUT_DOWNSAMPLE_Y_4X) yscale = 4;
		if(usage & MALI_OUTPUT_DOWNSAMPLE_Y_8X) yscale = 8;
		if(usage & MALI_OUTPUT_DOWNSAMPLE_Y_16X) yscale = 16;

		if(xscale > largest_xscale) largest_xscale = xscale;
		if(yscale > largest_yscale) largest_yscale = yscale;

		w = surf->format.width * xscale;
		h = surf->format.height * yscale;

		if(output_width == 0) output_width = w;
		if(output_height == 0) output_height = h;
		if(output_width != w || output_height != h) output_valid = MALI_FALSE;

		/* For non-linear layouts, the bbox is always disabled. For linear layouts, it will likely be enabled */
		if(surf->format.pixel_layout == MALI_PIXEL_LAYOUT_LINEAR)
		{
			/* grab the common ground bbox dimension */
			if(bb_width == 0) bb_width = surf->format.width;
			if(bb_height == 0) bb_height = surf->format.height;

			/* if the dimensions are not divisible by a tile, enable the bbox */
			if( (bb_width & 0xf) != 0 || (bb_height & 0xf) != 0)
			{
				bb_enable[i] = MALI_TRUE;
				bb_used = MALI_TRUE;
			}

			/* if the bbox dimensions don't add up, the setup is not legal (see #4 in the huge comment earlier) */
			if(bb_width != surf->format.width || bb_height != surf->format.height) output_valid = MALI_FALSE;
		}

		if ( MALI_PIXEL_FORMAT_ARGB_FP16 == surf->format.pixel_format
		 || MALI_PIXEL_FORMAT_B_FP16 == surf->format.pixel_format
		 || MALI_PIXEL_FORMAT_GB_FP16 == surf->format.pixel_format )
		{
			frame_builder->fp16_format_used = MALI_TRUE;
		}

	}

	/* HW only support rendering to non-0-sized outputs */
	if(output_width == 0 || output_height == 0) output_valid = MALI_FALSE;

	/* store new state in framebuilder */
	frame_builder->output_valid = output_valid;
	if(output_valid)
	{
		if(output_width != frame_builder->output_width || output_height != frame_builder->output_height)
		{
			frame_builder->output_width = output_width;
			frame_builder->output_height = output_height;
		}
		frame_builder->output_log2_scale_x = _mali_log_base2(largest_xscale);
		frame_builder->output_log2_scale_y = _mali_log_base2(largest_yscale);
		frame_builder->bounding_box_width = bb_width;
		frame_builder->bounding_box_height = bb_height;
		frame_builder->bounding_box_used = bb_used;
		for(i = 0; i < MALI200_WRITEBACK_UNIT_COUNT; i++)
		{
			frame_builder->bounding_box_enable[i] = bb_enable[i];
		}
	} else{
		frame_builder->output_width = 0;
		frame_builder->output_height = 0;
		frame_builder->output_log2_scale_x = 0;
		frame_builder->output_log2_scale_y = 0;
		frame_builder->bounding_box_width = 0;
		frame_builder->bounding_box_height = 0;
		frame_builder->bounding_box_used = MALI_FALSE;
		for(i = 0; i < MALI200_WRITEBACK_UNIT_COUNT; i++)
		{
			frame_builder->bounding_box_enable[i] = MALI_FALSE;
		}
	}

}

MALI_EXPORT struct mali_surface* _mali_frame_builder_get_output( mali_frame_builder *frame_builder,
                                                                    u32 wbx_id, u32* out_usage)
{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );


	MALI_DEBUG_ASSERT_RANGE( (int)wbx_id, 0, MALI200_WRITEBACK_UNIT_COUNT - 1);
	if(out_usage) *out_usage = frame_builder->output_buffers[wbx_id].usage;

	return frame_builder->output_buffers[wbx_id].buffer;
}

MALI_EXPORT void _mali_frame_builder_set_readback( mali_frame_builder *frame_builder,
                                                  u32 readback_surface_id,
                                                  struct mali_surface *surface,
                                                  u32 usage )
{
	struct mali_frame_builder_output_chain *readback;

	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_DEBUG_ASSERT_RANGE( (int)readback_surface_id, 0, MALI_READBACK_SURFACES_COUNT - 1);

	/* attach surfaces to the fbuilder, detach old surfaces */
	if ( NULL != surface )
	{
		_mali_surface_addref(surface);
	}

	readback = &frame_builder->readback_buffers[readback_surface_id];

	if(readback->buffer)
	{
		_mali_surface_deref(readback->buffer);
	}

	readback->buffer = surface;
	readback->usage  = usage;

}

MALI_EXPORT struct mali_surface* _mali_frame_builder_get_readback( mali_frame_builder *frame_builder,
                                                                    u32 readback_surface_id, u32* readback_usage)
{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	MALI_DEBUG_ASSERT_RANGE( (int)readback_surface_id, 0, MALI_READBACK_SURFACES_COUNT - 1);
	if(readback_usage) *readback_usage = frame_builder->readback_buffers[readback_surface_id].usage;

	return frame_builder->readback_buffers[readback_surface_id].buffer;
}

MALI_EXPORT void _mali_frame_builder_get_consumer_pp_render( mali_frame_builder *frame_builder, mali_ds_consumer_handle *ds_consumer_pp_render )
{
	mali_internal_frame* frame = NULL;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );
	*ds_consumer_pp_render = frame->ds_consumer_pp_render;
}

MALI_EXPORT void _mali_frame_builder_set_lock_output_callback( mali_frame_builder *frame_builder,
                                                               mali_frame_cb_func cb_func,
                                                               mali_frame_cb_param cb_param,
                                                               mali_ds_consumer_handle *ds_consumer_pp_render )
{
	mali_internal_frame* frame = NULL;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );
	frame->cb_func_lock_output = cb_func;
	frame->cb_param_lock_output = cb_param;
	if ( ds_consumer_pp_render ) *ds_consumer_pp_render = frame->ds_consumer_pp_render;

}

MALI_EXPORT void _mali_frame_builder_set_complete_output_callback( mali_frame_builder *frame_builder,
                                                                   mali_frame_cb_func cb_func,
                                                                   mali_frame_cb_param cb_param )
{
	mali_internal_frame *frame = NULL;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );
	frame->cb_func_complete_output = cb_func;
	frame->cb_param_complete_output = cb_param;
}

MALI_EXPORT void _mali_frame_builder_set_acquire_output_callback( mali_frame_builder *frame_builder, 
                                                                 mali_frame_cb_func cb_func, 
                                                                 mali_frame_cb_param cb_param )
{
	mali_internal_frame* frame = NULL;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

