NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );
	frame->cb_func_acquire_output = cb_func;
	frame->cb_param_acquire_output = cb_param;
}

#if MALI_EXTERNAL_SYNC

MALI_EXPORT void _mali_frame_builder_set_pp_job_start_callback(
	mali_frame_builder *frame_builder,
	mali_frame_pp_job_start_cb_func cb_func,
	mali_frame_cb_param cb_param )
{
	mali_internal_frame *frame = NULL;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );
	frame->cb_func_pp_job_start = cb_func;
	frame->cb_param_pp_job_start = cb_param;
}

MALI_EXPORT void _mali_frame_builder_set_output_fence( mali_frame_builder *frame_builder, mali_fence_handle fence )
{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	if (MALI_FENCE_INVALID_HANDLE != frame_builder->output_fence)
	{
		mali_fence_release(frame_builder->output_fence);
	}

	frame_builder->output_fence = fence;
}

MALI_EXPORT void _mali_frame_builder_set_fence_sync_data( mali_frame_builder *frame_builder, void *data )
{
	mali_internal_frame *frame;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	frame->fence_sync = data;
}

#endif /* MALI_EXTERNAL_SYNC */

MALI_EXPORT void _mali_frame_builder_acquire_output( mali_frame_builder *frame_builder )
{
	mali_internal_frame* frame = NULL;
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	if ( NULL != frame->cb_func_acquire_output )
	{
		(frame->cb_func_acquire_output)(frame->cb_param_acquire_output);
	}
}

MALI_EXPORT void _mali_frame_builder_set_clear_value( mali_frame_builder *frame_builder,
                                                      u32 buffer_type,
                                                      u32 clear_value )
{

	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	switch( buffer_type )
	{
		case MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_R:
			MALI_DEBUG_ASSERT(clear_value <= 0xFFFF, ("Legal clear range for color is 0 - 0xFFFF inclusive"));
			if(frame_builder->color_clear_value[0] != clear_value)
			{
				frame_builder->buffer_state_per_plane &= ~MALI_COLOR_PLANE_MASK;
				frame_builder->buffer_state_per_plane |= MALI_COLOR_PLANE_DIRTY;
			}
			frame_builder->color_clear_value[0] = clear_value;
			break;
		case MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_G:
			MALI_DEBUG_ASSERT(clear_value <= 0xFFFF, ("Legal clear range for color is 0 - 0xFFFF inclusive"));
			if(frame_builder->color_clear_value[1] != clear_value)
			{
				frame_builder->buffer_state_per_plane &= ~MALI_COLOR_PLANE_MASK;
				frame_builder->buffer_state_per_plane |= MALI_COLOR_PLANE_DIRTY;
			}
			frame_builder->color_clear_value[1] = clear_value;
			break;
		case MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_B:
			MALI_DEBUG_ASSERT(clear_value <= 0xFFFF, ("Legal clear range for color is 0 - 0xFFFF inclusive"));
			if(frame_builder->color_clear_value[2] != clear_value)
			{
				frame_builder->buffer_state_per_plane &= ~MALI_COLOR_PLANE_MASK;
				frame_builder->buffer_state_per_plane |= MALI_COLOR_PLANE_DIRTY;
			}
			frame_builder->color_clear_value[2] = clear_value;
			break;
		case MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_A:
			MALI_DEBUG_ASSERT(clear_value <= 0xFFFF, ("Legal clear range for color is 0 - 0xFFFF inclusive"));
			if(frame_builder->color_clear_value[3] != clear_value)
			{
				frame_builder->buffer_state_per_plane &= ~MALI_COLOR_PLANE_MASK;
				frame_builder->buffer_state_per_plane |= MALI_COLOR_PLANE_DIRTY;
			}
			frame_builder->color_clear_value[3] = clear_value;
			break;
		case MALI_FRAME_BUILDER_BUFFER_BIT_DEPTH:
			MALI_DEBUG_ASSERT(clear_value <= 0xFFFFFF, ("Legal clear range for depth is 0 - 0xFFFFFF inclusive"));
			if(frame_builder->depth_clear_value != clear_value)
			{
				frame_builder->buffer_state_per_plane &= ~MALI_DEPTH_PLANE_MASK;
				frame_builder->buffer_state_per_plane |= MALI_DEPTH_PLANE_DIRTY;
			}
			frame_builder->depth_clear_value = clear_value;
			break;
		case MALI_FRAME_BUILDER_BUFFER_BIT_STENCIL:
			MALI_DEBUG_ASSERT(clear_value <= 0xFF, ("Legal clear range for stencil is 0 - 0xFF inclusive"));
			if(frame_builder->stencil_clear_value != clear_value)
			{
				frame_builder->buffer_state_per_plane &= ~MALI_STENCIL_PLANE_MASK;
				frame_builder->buffer_state_per_plane |= MALI_STENCIL_PLANE_DIRTY;
			}
			frame_builder->stencil_clear_value = clear_value;
			break;
		default:
			MALI_DEBUG_ASSERT( 0, ("invalid buffer type\n") );
			break;
	}
}

MALI_EXPORT u32 _mali_frame_builder_get_clear_value( mali_frame_builder *frame_builder,
                                                     u32 buffer_type )
{
	u32 clear_value;

	switch( buffer_type )
	{
	case MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_R:
		clear_value = frame_builder->color_clear_value[0];
		break;
	case MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_G:
		clear_value = frame_builder->color_clear_value[1];
		break;
	case MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_B:
		clear_value = frame_builder->color_clear_value[2];
		break;
	case MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_A:
		clear_value = frame_builder->color_clear_value[3];
		break;
	case MALI_FRAME_BUILDER_BUFFER_BIT_DEPTH:
		clear_value = frame_builder->depth_clear_value;
		break;
	case MALI_FRAME_BUILDER_BUFFER_BIT_STENCIL:
		clear_value = frame_builder->stencil_clear_value;
		break;
	default:
		clear_value = 0;
		MALI_DEBUG_ASSERT( 0, ("invalid buffer type\n") );
		break;
	}

	return clear_value;
}

MALI_EXPORT mali_job_completion_status _mali_frame_builder_get_framebuilder_completion_status( mali_frame_builder *frame_builder )
{
	mali_job_completion_status frame_builder_error = MALI_JOB_STATUS_END_SUCCESS;
	mali_job_completion_status err;
	u32 i;

	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	/* Cycles through and clears the error state of all frames. The error of the last erroneous
	 * frame is returned */
	for (i = 0; i < frame_builder->iframe_count ; ++i)
	{
		if ( (frame_builder->iframes != NULL) && (frame_builder->iframes[i] != NULL) )
		{
			err = (mali_job_completion_status)_mali_sys_atomic_get( &(frame_builder->iframes[i]->completion_status) );
			if ( MALI_JOB_STATUS_END_SUCCESS != err )
			{
				/* Clear frame state */
				frame_builder_error = err;
				_mali_sys_atomic_set( &(frame_builder->iframes[i]->completion_status), (u32)MALI_JOB_STATUS_END_SUCCESS );
			}
		}
	}

#if MALI_PERFORMANCE_KIT
	if (mali_complete_jobs_instantly == 1)
	{
		frame_builder_error = MALI_JOB_STATUS_END_SUCCESS; /* fake success */
	}
#endif

