NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
	return frame_builder_error;
}


/* Mali200 frame builder specific functions ---------------------------------------------------------------- */
MALI_EXPORT void _mali_frame_builder_update_fragment_stack( mali_frame_builder *frame_builder, u32 stack_start, u32 stack_size )
{
	u32 stack_grow;
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	/* store the maximum stack requirements for the fragment shader */
	stack_grow  = stack_size - stack_start;

	frame->fs_stack.start = MAX( frame->fs_stack.start, stack_start );
	frame->fs_stack.grow  = MAX( frame->fs_stack.grow,  stack_grow );

}

MALI_EXPORT mali_err_code _mali_frame_builder_scissor( mali_frame_builder *frame_builder, u32 left, u32 top, u32 right, u32 bottom,
                                                       mali_gp_plbu_cmd * const buffer, u32 * const index, const u32 buffer_len )
{
	mali_err_code err = MALI_ERR_NO_ERROR;
	mali_gp_job_handle gp_job;
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	MALI_DEBUG_ASSERT( (frame->state != FRAME_CLEAN),
	                   ("must call _mali_frame_builder_use() before this function\n") );

	MALI_DEBUG_ASSERT( (( (u32) frame_builder->output_width  > left) &&
	                    ( (u32) frame_builder->output_width  > right) &&
	                    ( (u32) frame_builder->output_height > top) &&
	                    ( (u32) frame_builder->output_height > bottom)),
	                   ("scissorbox (%d, %d, %d, %d) is not within the frame_builder dimensions ( %d, %d)\n",
	                   left, top, right, bottom, frame_builder->output_width, frame_builder->output_height ) );

	/* early out if there is no change in the scissor state */
	if( (left == frame_builder->scissor.left) && (right  == frame_builder->scissor.right) &&
		(top  == frame_builder->scissor.top)  && (bottom == frame_builder->scissor.bottom) ) return MALI_ERR_NO_ERROR;

	/* store the new current scissorbox */
	frame_builder->scissor.left   = left;
	frame_builder->scissor.top    = top;
	frame_builder->scissor.right  = right;
	frame_builder->scissor.bottom = bottom;

	gp_job = frame->gp_job;
	MALI_DEBUG_ASSERT_HANDLE( gp_job );

	if ( buffer != NULL )
	{
		u32 idx = *index;
		MALI_DEBUG_ASSERT( idx < buffer_len, ( "plbu stream buffer overflow" ) );
		buffer[idx++] = GP_PLBU_COMMAND_SET_SCISSOR( top, bottom, left, right);
		MALI_DEBUG_ASSERT( idx <= buffer_len, ( "plbu stream buffer overflow" ) );
		*index = idx;
	} else
	{
		MALI_IGNORE( buffer_len );
		MALI_IGNORE( index );
		err = _mali_gp_job_add_plbu_cmd( gp_job, GP_PLBU_COMMAND_SET_SCISSOR( top, bottom, left, right ) );
	}

	return err;
}

MALI_EXPORT mali_err_code _mali_frame_builder_viewport( mali_frame_builder *frame_builder, float left, float top, float right, float bottom,
                                                        mali_gp_plbu_cmd * const buffer, u32 * const index, const u32 buffer_len )
{
	mali_err_code err = MALI_ERR_NO_ERROR;

	/* Init of viewportbox[] to stop an incorrect warning from Coverity as it doesn't handle unions correctly */
	union {
		float f;
		u32   i;
	} viewportbox[4] = { {0}, {0}, {0}, {0}};
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	MALI_DEBUG_ASSERT( (frame->state != FRAME_CLEAN),
	                   ("must call _mali_frame_builder_use() before this function\n") );

	/* early out if there is no change in the scissor state */
	if( (left == frame_builder->vpbox.left) && (right  == frame_builder->vpbox.right) &&
		(top  == frame_builder->vpbox.top)  && (bottom == frame_builder->vpbox.bottom) ) return MALI_ERR_NO_ERROR;

	/* store the new current viewportbox */
	frame_builder->vpbox.left   = left;
	frame_builder->vpbox.top    = top;
	frame_builder->vpbox.right  = right;
	frame_builder->vpbox.bottom = bottom;

	frame->vpbox.left   = left;
	frame->vpbox.top    = top;
	frame->vpbox.right  = right;
	frame->vpbox.bottom = bottom;

	/* Setting initial viewportbox to fullscreen
	 * Using unions since the binary representation of the floats have to be written to the PLBUs config registers
	 */
#if HARDWARE_ISSUE_3396
	/* the interface had a different behavior prior to this fix. Must handle inclusive bounds by adding x < 1 */
	viewportbox[ 0 ].f = (float) left;
	viewportbox[ 1 ].f = (float) right  + 0.99;
	viewportbox[ 2 ].f = (float) top;
	viewportbox[ 3 ].f = (float) bottom + 0.99;
#else
	viewportbox[ 0 ].f = left;
	viewportbox[ 1 ].f = right;
	viewportbox[ 2 ].f = top;
	viewportbox[ 3 ].f = bottom;
#endif

	if ( buffer != NULL )
	{
		u32 idx = *index;
		MALI_DEBUG_ASSERT( idx < buffer_len, ( "plbu stream buffer overflow" ) );
		buffer[idx++] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[0].i, GP_PLBU_CONF_REG_SCISSOR_LEFT );
		buffer[idx++] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[1].i, GP_PLBU_CONF_REG_SCISSOR_RIGHT );
		buffer[idx++] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[2].i, GP_PLBU_CONF_REG_SCISSOR_TOP );
		buffer[idx++] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[3].i, GP_PLBU_CONF_REG_SCISSOR_BOTTOM );
		MALI_DEBUG_ASSERT( idx <= buffer_len, ( "plbu stream buffer overflow" ) );
		*index = idx;
	} else
	{
		mali_gp_plbu_cmd cmds[ 4 ];
		mali_gp_job_handle gp_job;

		MALI_IGNORE( buffer_len );
		MALI_IGNORE( index );

		gp_job = frame->gp_job;
		MALI_DEBUG_ASSERT_HANDLE( gp_job );

		cmds[ 0 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[0].i, GP_PLBU_CONF_REG_SCISSOR_LEFT );
		cmds[ 1 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[1].i, GP_PLBU_CONF_REG_SCISSOR_RIGHT );
		cmds[ 2 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[2].i, GP_PLBU_CONF_REG_SCISSOR_TOP );
		cmds[ 3 ] = GP_PLBU_COMMAND_WRITE_CONF_REG( viewportbox[3].i, GP_PLBU_CONF_REG_SCISSOR_BOTTOM );

		err = _mali_gp_job_add_plbu_cmds( gp_job, cmds, sizeof( cmds ) / sizeof( mali_gp_plbu_cmd ) );
	}

	return err;
}

MALI_EXPORT mali_base_ctx_handle _mali_frame_builder_get_base_ctx( mali_frame_builder *frame_builder )
{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	return frame_builder->base_ctx;
}

MALI_EXPORT void _mali_frame_builder_set_split_count( mali_frame_builder *frame_builder, u32 split_cnt )
{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	if (split_cnt != frame_builder->curr_pp_split_count)
	{
		MALI_DEBUG_ASSERT_RANGE(split_cnt, 1, MALI_MAX_PP_SPLIT_COUNT);

