NexellCorp/android_hal_pyrope/ogl_4330/src/shared/m200_gp_frame_builder.c
		frame_builder->curr_pp_split_count = split_cnt;
	}
}

MALI_EXPORT mali_bool _mali_frame_builder_incremental_rendering_requested( mali_frame_builder *frame_builder )
{
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	return (frame->num_flushes_since_reset > frame_builder->incremental_render_flush_threshold);
}

MALI_EXPORT mali_err_code _mali_frame_builder_write_lock( mali_frame_builder *frame_builder, u8 dirtiness_mask  )
{
	u32 index;
	mali_internal_frame *frame;
	mali_err_code error = MALI_ERR_NO_ERROR;

	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_DEBUG_ASSERT(frame_builder->output_valid == MALI_TRUE, ("Framebuilder outputs set up incorrectly"));

	_mali_frame_builder_acquire_output( frame_builder );

	if (dirtiness_mask & MALI_FRAME_BUILDER_BUFFER_BIT_COLOR_ALL_CHANNELS)
	{
		frame_builder->buffer_state_per_plane &= ~MALI_COLOR_PLANE_MASK;
		frame_builder->buffer_state_per_plane |= MALI_COLOR_PLANE_DIRTY;  
	}
	if (dirtiness_mask & MALI_FRAME_BUILDER_BUFFER_BIT_DEPTH)
	{
		frame_builder->buffer_state_per_plane &= ~MALI_DEPTH_PLANE_MASK;
		frame_builder->buffer_state_per_plane |= MALI_DEPTH_PLANE_DIRTY;  
	}
	if (dirtiness_mask & MALI_FRAME_BUILDER_BUFFER_BIT_STENCIL)
	{
		frame_builder->buffer_state_per_plane &= ~MALI_STENCIL_PLANE_MASK;
		frame_builder->buffer_state_per_plane |= MALI_STENCIL_PLANE_DIRTY;  
	}
	if (dirtiness_mask & MALI_FRAME_BUILDER_BUFFER_BIT_MULTISAMPLE) frame_builder->preserve_multisample = MALI_TRUE;	

	/* take the frame lock */
	frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	/* wait for current frame to finish any mali processing */
	_mali_frame_wait_and_take_mutex( frame );

	error = _frame_builder_use_internal( frame_builder, frame );

	_mali_sys_mutex_unlock( frame->mutex );

	if ( MALI_ERR_NO_ERROR != error )
	{
		return error;
	}

	for ( index = 0; index < MALI200_WRITEBACK_UNIT_COUNT; index++)
	{
		struct mali_surface* surface = frame_builder->output_buffers[index].buffer;
		if( surface == NULL ) continue;

	}


	/* At this point we have acquired locks on the relevant surfaces. */
	MALI_SUCCESS;
}

MALI_EXPORT void _mali_frame_builder_write_unlock( mali_frame_builder *frame_builder )
{
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_IGNORE( frame_builder );
}



MALI_EXPORT void _mali_frame_builder_discard_surface_write_back(mali_frame_builder* frame_builder, mali_surface* surf, u32 wb_unit)
{
	u32 i;
	u32 fb_ptr;

	MALI_DEBUG_ASSERT_POINTER(frame_builder);
	MALI_DEBUG_ASSERT_POINTER(surf);
	MALI_DEBUG_ASSERT_POINTER(surf->mem_ref);

	fb_ptr = (u32) _mali_mem_mali_addr_get( surf->mem_ref->mali_memory, surf->mem_offset );
	for(i=0; i<frame_builder->iframe_count; i++)
	{
		mali_internal_frame* iframe = frame_builder->iframes[i];
		MALI_DEBUG_ASSERT_POINTER(iframe);
		_mali_sys_mutex_lock(iframe->mutex);

		if(FRAME_RENDERING==iframe->state)
		{
			mali_pp_job_handle pp_job = iframe->pp_job;
			
			if ( pp_job )
			{
				if( fb_ptr == _m200_wb_attachment_address( pp_job, wb_unit ) )
				{
					if( _mali_pp_job_is_updateable(pp_job) )
					{
						_m200_wb_discard_attachment( pp_job, wb_unit );
					}
				}
			}
		}
		_mali_sys_mutex_unlock(iframe->mutex);
	}
}

MALI_EXPORT mali_err_code _mali_frame_builder_add_surface_read_dependency(mali_frame_builder* frame_builder, mali_surface* surface)
{
	mali_err_code err;
	mali_internal_frame* frame = GET_CURRENT_INTERNAL_FRAME( frame_builder );

	MALI_DEBUG_ASSERT( frame->state == FRAME_DIRTY , ("Adding a surface_read_dependency to an undirty frame! state = %d \n", frame->state));

	/**
	 * Comment on this if condition: 
	 * Bug 6400 prevents unmovable surfaces from being Copy-on-writed
	 * Copy on Write is the currently only way to avoid dependency deadlocks. 
	 * To avoid deadlocks with pixmaps and other non-movable surfaces, adding a read dependency is not possible 
	 */
	if(! (surface->flags & MALI_SURFACE_FLAG_DONT_MOVE) )
	{
		/* only add READ dependency on movable surfaces */
		err = mali_ds_connect(frame->ds_consumer_pp_render, surface->ds_resource, MALI_DS_READ);
		surface->flags |= MALI_SURFACE_FLAG_READ_PENDING;
		if(err != MALI_ERR_NO_ERROR) return err;
	}

	err = _mali_surfacetracking_add(frame->surfacetracking, surface, MALI_SURFACE_TRACKING_READ);

	return err;
}

MALI_EXPORT mali_incremental_render_capabilities _mali_frame_builder_get_targets_to_preserve( mali_frame_builder* frame_builder)
{
	int i;
	mali_incremental_render_capabilities capabilities = 0;

	MALI_DEBUG_ASSERT_POINTER( frame_builder );

	/* Preserve COLOR, DEPTH or STENCIL bits? 
	 * if the buffer bit is "cleared", we need to output the buffer later in the incremental render, but we don't need the readback. We could just clear again.
	 */
	if( (frame_builder->buffer_state_per_plane & (MALI_COLOR_PLANE_DIRTY | MALI_COLOR_PLANE_CLEAR_TO_COLOR))) capabilities |= MALI_INCREMENTAL_RENDER_PRESERVE_COLOR_BUFFER;
	if( (frame_builder->buffer_state_per_plane & (MALI_DEPTH_PLANE_DIRTY | MALI_DEPTH_PLANE_CLEAR_TO_COLOR))) capabilities |= MALI_INCREMENTAL_RENDER_PRESERVE_DEPTH_BUFFER;
	if( (frame_builder->buffer_state_per_plane & (MALI_STENCIL_PLANE_DIRTY | MALI_STENCIL_PLANE_CLEAR_TO_COLOR))) capabilities |= MALI_INCREMENTAL_RENDER_PRESERVE_STENCIL_BUFFER;
		
	/* Preserve SUPERSAMPLE bit? */
	for ( i = 0; i < MALI200_WRITEBACK_UNIT_COUNT; i++ )
	{
		if(frame_builder->output_buffers[i].buffer)
		{
			if(frame_builder->output_buffers[i].usage & (
						MALI_OUTPUT_DOWNSAMPLE_X_2X |
						MALI_OUTPUT_DOWNSAMPLE_X_4X |
						MALI_OUTPUT_DOWNSAMPLE_X_8X |
						MALI_OUTPUT_DOWNSAMPLE_Y_2X |
						MALI_OUTPUT_DOWNSAMPLE_Y_4X |
						MALI_OUTPUT_DOWNSAMPLE_Y_8X |
						MALI_OUTPUT_DOWNSAMPLE_Y_16X
						)
			  )
				capabilities |= MALI_INCREMENTAL_RENDER_PRESERVE_SUPERSAMPLING;
			break;
		}
	}

	/* Preserve MULTISAMPLE bit? */
	if(frame_builder->preserve_multisample) capabilities |= MALI_INCREMENTAL_RENDER_PRESERVE_MULTISAMPLING;

	return capabilities;
}

#if MALI_TEST_API
MALI_EXPORT void _mali_frame_builder_set_incremental_render_threshold( mali_frame_builder *frame_builder,
                                                                       u32                 threshold )
{
	frame_builder->incremental_render_flush_threshold = threshold;
}
#endif
